Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xe00 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 32 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x1b128): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x78910): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x49144): C:/Users/HP/STM32CubeIDE/workspace_1.16.0/2LED/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 8 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x43f81): signed char
 <1><31>: Abbrev Number: 8 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x1b727): unsigned char
 <1><38>: Abbrev Number: 8 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x651de): short int
 <1><3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0x6f0ac): __uint16_t
    <44>   DW_AT_decl_file   : 3
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 8 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x2c6b3): short unsigned int
 <1><52>: Abbrev Number: 8 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0xb862): long int
 <1><59>: Abbrev Number: 4 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x56509): __uint32_t
    <5e>   DW_AT_decl_file   : 3
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 8 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x1ff2c): long unsigned int
 <1><6c>: Abbrev Number: 8 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x3e304): long long int
 <1><73>: Abbrev Number: 8 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x1bea3): long long unsigned int
 <1><7a>: Abbrev Number: 33 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 8 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0xb260): unsigned int
 <1><88>: Abbrev Number: 4 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x631e7): uint16_t
    <8d>   DW_AT_decl_file   : 4
    <8e>   DW_AT_decl_line   : 36
    <8f>   DW_AT_decl_column : 20
    <90>   DW_AT_type        : <0x3f>
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x62afc): uint32_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a6>   DW_AT_byte_size   : 16
    <a7>   DW_AT_decl_file   : 5
    <a8>   DW_AT_decl_line   : 290
    <aa>   DW_AT_decl_column : 9
    <aa>   DW_AT_sibling     : <0xe5>
 <2><ae>: Abbrev Number: 5 (DW_TAG_member)
    <af>   DW_AT_name        : CCR
    <b3>   DW_AT_decl_file   : 5
    <b3>   DW_AT_decl_line   : 292
    <b5>   DW_AT_decl_column : 17
    <b5>   DW_AT_type        : <0xa0>
    <b9>   DW_AT_data_member_location: 0
 <2><ba>: Abbrev Number: 3 (DW_TAG_member)
    <bb>   DW_AT_name        : (indirect string, offset: 0x3451b): CNDTR
    <bf>   DW_AT_decl_file   : 5
    <c0>   DW_AT_decl_line   : 293
    <c2>   DW_AT_decl_column : 17
    <c3>   DW_AT_type        : <0xa0>
    <c7>   DW_AT_data_member_location: 4
 <2><c8>: Abbrev Number: 3 (DW_TAG_member)
    <c9>   DW_AT_name        : (indirect string, offset: 0x822c4): CPAR
    <cd>   DW_AT_decl_file   : 5
    <ce>   DW_AT_decl_line   : 294
    <d0>   DW_AT_decl_column : 17
    <d1>   DW_AT_type        : <0xa0>
    <d5>   DW_AT_data_member_location: 8
 <2><d6>: Abbrev Number: 3 (DW_TAG_member)
    <d7>   DW_AT_name        : (indirect string, offset: 0x4ad36): CMAR
    <db>   DW_AT_decl_file   : 5
    <dc>   DW_AT_decl_line   : 295
    <de>   DW_AT_decl_column : 17
    <df>   DW_AT_type        : <0xa0>
    <e3>   DW_AT_data_member_location: 12
 <2><e4>: Abbrev Number: 0
 <1><e5>: Abbrev Number: 9 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x6e881): DMA_Channel_TypeDef
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 296
    <ed>   DW_AT_decl_column : 3
    <ee>   DW_AT_type        : <0xa5>
 <1><f2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f3>   DW_AT_byte_size   : 8
    <f4>   DW_AT_decl_file   : 5
    <f5>   DW_AT_decl_line   : 298
    <f7>   DW_AT_decl_column : 9
    <f7>   DW_AT_sibling     : <0x116>
 <2><fb>: Abbrev Number: 5 (DW_TAG_member)
    <fc>   DW_AT_name        : ISR
    <100>   DW_AT_decl_file   : 5
    <100>   DW_AT_decl_line   : 300
    <102>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xa0>
    <106>   DW_AT_data_member_location: 0
 <2><107>: Abbrev Number: 3 (DW_TAG_member)
    <108>   DW_AT_name        : (indirect string, offset: 0x5f31d): IFCR
    <10c>   DW_AT_decl_file   : 5
    <10d>   DW_AT_decl_line   : 301
    <10f>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xa0>
    <114>   DW_AT_data_member_location: 4
 <2><115>: Abbrev Number: 0
 <1><116>: Abbrev Number: 9 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0x314e4): DMA_TypeDef
    <11b>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 302
    <11e>   DW_AT_decl_column : 3
    <11f>   DW_AT_type        : <0xf2>
 <1><123>: Abbrev Number: 13 (DW_TAG_structure_type)
    <124>   DW_AT_byte_size   : 28
    <125>   DW_AT_decl_file   : 5
    <126>   DW_AT_decl_line   : 357
    <128>   DW_AT_decl_column : 9
    <128>   DW_AT_sibling     : <0x185>
 <2><12c>: Abbrev Number: 5 (DW_TAG_member)
    <12d>   DW_AT_name        : CRL
    <131>   DW_AT_decl_file   : 5
    <131>   DW_AT_decl_line   : 359
    <133>   DW_AT_decl_column : 17
    <133>   DW_AT_type        : <0xa0>
    <137>   DW_AT_data_member_location: 0
 <2><138>: Abbrev Number: 5 (DW_TAG_member)
    <139>   DW_AT_name        : CRH
    <13d>   DW_AT_decl_file   : 5
    <13d>   DW_AT_decl_line   : 360
    <13f>   DW_AT_decl_column : 17
    <13f>   DW_AT_type        : <0xa0>
    <143>   DW_AT_data_member_location: 4
 <2><144>: Abbrev Number: 5 (DW_TAG_member)
    <145>   DW_AT_name        : IDR
    <149>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 361
    <14b>   DW_AT_decl_column : 17
    <14b>   DW_AT_type        : <0xa0>
    <14f>   DW_AT_data_member_location: 8
 <2><150>: Abbrev Number: 5 (DW_TAG_member)
    <151>   DW_AT_name        : ODR
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 362
    <157>   DW_AT_decl_column : 17
    <157>   DW_AT_type        : <0xa0>
    <15b>   DW_AT_data_member_location: 12
 <2><15c>: Abbrev Number: 3 (DW_TAG_member)
    <15d>   DW_AT_name        : (indirect string, offset: 0x1e568): BSRR
    <161>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 363
    <164>   DW_AT_decl_column : 17
    <165>   DW_AT_type        : <0xa0>
    <169>   DW_AT_data_member_location: 16
 <2><16a>: Abbrev Number: 5 (DW_TAG_member)
    <16b>   DW_AT_name        : BRR
    <16f>   DW_AT_decl_file   : 5
    <16f>   DW_AT_decl_line   : 364
    <171>   DW_AT_decl_column : 17
    <171>   DW_AT_type        : <0xa0>
    <175>   DW_AT_data_member_location: 20
 <2><176>: Abbrev Number: 3 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x746f4): LCKR
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 365
    <17e>   DW_AT_decl_column : 17
    <17f>   DW_AT_type        : <0xa0>
    <183>   DW_AT_data_member_location: 24
 <2><184>: Abbrev Number: 0
 <1><185>: Abbrev Number: 9 (DW_TAG_typedef)
    <186>   DW_AT_name        : (indirect string, offset: 0x82d8e): GPIO_TypeDef
    <18a>   DW_AT_decl_file   : 5
    <18b>   DW_AT_decl_line   : 366
    <18d>   DW_AT_decl_column : 3
    <18e>   DW_AT_type        : <0x123>
 <1><192>: Abbrev Number: 13 (DW_TAG_structure_type)
    <193>   DW_AT_byte_size   : 40
    <194>   DW_AT_decl_file   : 5
    <195>   DW_AT_decl_line   : 423
    <197>   DW_AT_decl_column : 9
    <197>   DW_AT_sibling     : <0x221>
 <2><19b>: Abbrev Number: 5 (DW_TAG_member)
    <19c>   DW_AT_name        : CR
    <19f>   DW_AT_decl_file   : 5
    <19f>   DW_AT_decl_line   : 425
    <1a1>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xa0>
    <1a5>   DW_AT_data_member_location: 0
 <2><1a6>: Abbrev Number: 3 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x523f8): CFGR
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 426
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xa0>
    <1b3>   DW_AT_data_member_location: 4
 <2><1b4>: Abbrev Number: 5 (DW_TAG_member)
    <1b5>   DW_AT_name        : CIR
    <1b9>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 427
    <1bb>   DW_AT_decl_column : 17
    <1bb>   DW_AT_type        : <0xa0>
    <1bf>   DW_AT_data_member_location: 8
 <2><1c0>: Abbrev Number: 3 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3b414): APB2RSTR
    <1c5>   DW_AT_decl_file   : 5
    <1c6>   DW_AT_decl_line   : 428
    <1c8>   DW_AT_decl_column : 17
    <1c9>   DW_AT_type        : <0xa0>
    <1cd>   DW_AT_data_member_location: 12
 <2><1ce>: Abbrev Number: 3 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0xf554): APB1RSTR
    <1d3>   DW_AT_decl_file   : 5
    <1d4>   DW_AT_decl_line   : 429
    <1d6>   DW_AT_decl_column : 17
    <1d7>   DW_AT_type        : <0xa0>
    <1db>   DW_AT_data_member_location: 16
 <2><1dc>: Abbrev Number: 3 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xc722): AHBENR
    <1e1>   DW_AT_decl_file   : 5
    <1e2>   DW_AT_decl_line   : 430
    <1e4>   DW_AT_decl_column : 17
    <1e5>   DW_AT_type        : <0xa0>
    <1e9>   DW_AT_data_member_location: 20
 <2><1ea>: Abbrev Number: 3 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x1003b): APB2ENR
    <1ef>   DW_AT_decl_file   : 5
    <1f0>   DW_AT_decl_line   : 431
    <1f2>   DW_AT_decl_column : 17
    <1f3>   DW_AT_type        : <0xa0>
    <1f7>   DW_AT_data_member_location: 24
 <2><1f8>: Abbrev Number: 3 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x661ff): APB1ENR
    <1fd>   DW_AT_decl_file   : 5
    <1fe>   DW_AT_decl_line   : 432
    <200>   DW_AT_decl_column : 17
    <201>   DW_AT_type        : <0xa0>
    <205>   DW_AT_data_member_location: 28
 <2><206>: Abbrev Number: 3 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x1271a): BDCR
    <20b>   DW_AT_decl_file   : 5
    <20c>   DW_AT_decl_line   : 433
    <20e>   DW_AT_decl_column : 17
    <20f>   DW_AT_type        : <0xa0>
    <213>   DW_AT_data_member_location: 32
 <2><214>: Abbrev Number: 5 (DW_TAG_member)
    <215>   DW_AT_name        : CSR
    <219>   DW_AT_decl_file   : 5
    <219>   DW_AT_decl_line   : 434
    <21b>   DW_AT_decl_column : 17
    <21b>   DW_AT_type        : <0xa0>
    <21f>   DW_AT_data_member_location: 36
 <2><220>: Abbrev Number: 0
 <1><221>: Abbrev Number: 9 (DW_TAG_typedef)
    <222>   DW_AT_name        : (indirect string, offset: 0x3f13b): RCC_TypeDef
    <226>   DW_AT_decl_file   : 5
    <227>   DW_AT_decl_line   : 437
    <229>   DW_AT_decl_column : 3
    <22a>   DW_AT_type        : <0x192>
 <1><22e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <22f>   DW_AT_byte_size   : 84
    <230>   DW_AT_decl_file   : 5
    <231>   DW_AT_decl_line   : 476
    <233>   DW_AT_decl_column : 9
    <233>   DW_AT_sibling     : <0x348>
 <2><237>: Abbrev Number: 5 (DW_TAG_member)
    <238>   DW_AT_name        : CR1
    <23c>   DW_AT_decl_file   : 5
    <23c>   DW_AT_decl_line   : 478
    <23e>   DW_AT_decl_column : 17
    <23e>   DW_AT_type        : <0xa0>
    <242>   DW_AT_data_member_location: 0
 <2><243>: Abbrev Number: 5 (DW_TAG_member)
    <244>   DW_AT_name        : CR2
    <248>   DW_AT_decl_file   : 5
    <248>   DW_AT_decl_line   : 479
    <24a>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xa0>
    <24e>   DW_AT_data_member_location: 4
 <2><24f>: Abbrev Number: 3 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x61a35): SMCR
    <254>   DW_AT_decl_file   : 5
    <255>   DW_AT_decl_line   : 480
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 8
 <2><25d>: Abbrev Number: 3 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x2b55c): DIER
    <262>   DW_AT_decl_file   : 5
    <263>   DW_AT_decl_line   : 481
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0xa0>
    <26a>   DW_AT_data_member_location: 12
 <2><26b>: Abbrev Number: 5 (DW_TAG_member)
    <26c>   DW_AT_name        : SR
    <26f>   DW_AT_decl_file   : 5
    <26f>   DW_AT_decl_line   : 482
    <271>   DW_AT_decl_column : 17
    <271>   DW_AT_type        : <0xa0>
    <275>   DW_AT_data_member_location: 16
 <2><276>: Abbrev Number: 5 (DW_TAG_member)
    <277>   DW_AT_name        : EGR
    <27b>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 483
    <27d>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xa0>
    <281>   DW_AT_data_member_location: 20
 <2><282>: Abbrev Number: 3 (DW_TAG_member)
    <283>   DW_AT_name        : (indirect string, offset: 0x6367c): CCMR1
    <287>   DW_AT_decl_file   : 5
    <288>   DW_AT_decl_line   : 484
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xa0>
    <28f>   DW_AT_data_member_location: 24
 <2><290>: Abbrev Number: 3 (DW_TAG_member)
    <291>   DW_AT_name        : (indirect string, offset: 0x3617f): CCMR2
    <295>   DW_AT_decl_file   : 5
    <296>   DW_AT_decl_line   : 485
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xa0>
    <29d>   DW_AT_data_member_location: 28
 <2><29e>: Abbrev Number: 3 (DW_TAG_member)
    <29f>   DW_AT_name        : (indirect string, offset: 0x17dcf): CCER
    <2a3>   DW_AT_decl_file   : 5
    <2a4>   DW_AT_decl_line   : 486
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xa0>
    <2ab>   DW_AT_data_member_location: 32
 <2><2ac>: Abbrev Number: 5 (DW_TAG_member)
    <2ad>   DW_AT_name        : CNT
    <2b1>   DW_AT_decl_file   : 5
    <2b1>   DW_AT_decl_line   : 487
    <2b3>   DW_AT_decl_column : 17
    <2b3>   DW_AT_type        : <0xa0>
    <2b7>   DW_AT_data_member_location: 36
 <2><2b8>: Abbrev Number: 5 (DW_TAG_member)
    <2b9>   DW_AT_name        : PSC
    <2bd>   DW_AT_decl_file   : 5
    <2bd>   DW_AT_decl_line   : 488
    <2bf>   DW_AT_decl_column : 17
    <2bf>   DW_AT_type        : <0xa0>
    <2c3>   DW_AT_data_member_location: 40
 <2><2c4>: Abbrev Number: 5 (DW_TAG_member)
    <2c5>   DW_AT_name        : ARR
    <2c9>   DW_AT_decl_file   : 5
    <2c9>   DW_AT_decl_line   : 489
    <2cb>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0xa0>
    <2cf>   DW_AT_data_member_location: 44
 <2><2d0>: Abbrev Number: 5 (DW_TAG_member)
    <2d1>   DW_AT_name        : RCR
    <2d5>   DW_AT_decl_file   : 5
    <2d5>   DW_AT_decl_line   : 490
    <2d7>   DW_AT_decl_column : 17
    <2d7>   DW_AT_type        : <0xa0>
    <2db>   DW_AT_data_member_location: 48
 <2><2dc>: Abbrev Number: 3 (DW_TAG_member)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x10036): CCR1
    <2e1>   DW_AT_decl_file   : 5
    <2e2>   DW_AT_decl_line   : 491
    <2e4>   DW_AT_decl_column : 17
    <2e5>   DW_AT_type        : <0xa0>
    <2e9>   DW_AT_data_member_location: 52
 <2><2ea>: Abbrev Number: 3 (DW_TAG_member)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x3932c): CCR2
    <2ef>   DW_AT_decl_file   : 5
    <2f0>   DW_AT_decl_line   : 492
    <2f2>   DW_AT_decl_column : 17
    <2f3>   DW_AT_type        : <0xa0>
    <2f7>   DW_AT_data_member_location: 56
 <2><2f8>: Abbrev Number: 3 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x67fe5): CCR3
    <2fd>   DW_AT_decl_file   : 5
    <2fe>   DW_AT_decl_line   : 493
    <300>   DW_AT_decl_column : 17
    <301>   DW_AT_type        : <0xa0>
    <305>   DW_AT_data_member_location: 60
 <2><306>: Abbrev Number: 3 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0x8672): CCR4
    <30b>   DW_AT_decl_file   : 5
    <30c>   DW_AT_decl_line   : 494
    <30e>   DW_AT_decl_column : 17
    <30f>   DW_AT_type        : <0xa0>
    <313>   DW_AT_data_member_location: 64
 <2><314>: Abbrev Number: 3 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x3ec24): BDTR
    <319>   DW_AT_decl_file   : 5
    <31a>   DW_AT_decl_line   : 495
    <31c>   DW_AT_decl_column : 17
    <31d>   DW_AT_type        : <0xa0>
    <321>   DW_AT_data_member_location: 68
 <2><322>: Abbrev Number: 5 (DW_TAG_member)
    <323>   DW_AT_name        : DCR
    <327>   DW_AT_decl_file   : 5
    <327>   DW_AT_decl_line   : 496
    <329>   DW_AT_decl_column : 17
    <329>   DW_AT_type        : <0xa0>
    <32d>   DW_AT_data_member_location: 72
 <2><32e>: Abbrev Number: 3 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x74ad1): DMAR
    <333>   DW_AT_decl_file   : 5
    <334>   DW_AT_decl_line   : 497
    <336>   DW_AT_decl_column : 17
    <337>   DW_AT_type        : <0xa0>
    <33b>   DW_AT_data_member_location: 76
 <2><33c>: Abbrev Number: 5 (DW_TAG_member)
    <33d>   DW_AT_name        : OR
    <340>   DW_AT_decl_file   : 5
    <340>   DW_AT_decl_line   : 498
    <342>   DW_AT_decl_column : 17
    <342>   DW_AT_type        : <0xa0>
    <346>   DW_AT_data_member_location: 80
 <2><347>: Abbrev Number: 0
 <1><348>: Abbrev Number: 9 (DW_TAG_typedef)
    <349>   DW_AT_name        : (indirect string, offset: 0x1cd15): TIM_TypeDef
    <34d>   DW_AT_decl_file   : 5
    <34e>   DW_AT_decl_line   : 499
    <350>   DW_AT_decl_column : 2
    <351>   DW_AT_type        : <0x22e>
 <1><355>: Abbrev Number: 8 (DW_TAG_base_type)
    <356>   DW_AT_byte_size   : 8
    <357>   DW_AT_encoding    : 4	(float)
    <358>   DW_AT_name        : (indirect string, offset: 0xcb22): long double
 <1><35c>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <35d>   DW_AT_encoding    : 7	(unsigned)
    <35e>   DW_AT_byte_size   : 1
    <35f>   DW_AT_type        : <0x31>
    <363>   DW_AT_decl_file   : 6
    <364>   DW_AT_decl_line   : 39
    <365>   DW_AT_decl_column : 1
    <366>   DW_AT_sibling     : <0x383>
 <2><36a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <36b>   DW_AT_name        : (indirect string, offset: 0x2dc7e): HAL_OK
    <36f>   DW_AT_const_value : 0
 <2><370>: Abbrev Number: 1 (DW_TAG_enumerator)
    <371>   DW_AT_name        : (indirect string, offset: 0x54be4): HAL_ERROR
    <375>   DW_AT_const_value : 1
 <2><376>: Abbrev Number: 1 (DW_TAG_enumerator)
    <377>   DW_AT_name        : (indirect string, offset: 0x17995): HAL_BUSY
    <37b>   DW_AT_const_value : 2
 <2><37c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <37d>   DW_AT_name        : (indirect string, offset: 0x27fbd): HAL_TIMEOUT
    <381>   DW_AT_const_value : 3
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 4 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x19ab): HAL_StatusTypeDef
    <388>   DW_AT_decl_file   : 6
    <389>   DW_AT_decl_line   : 44
    <38a>   DW_AT_decl_column : 3
    <38b>   DW_AT_type        : <0x35c>
 <1><38f>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <390>   DW_AT_encoding    : 7	(unsigned)
    <391>   DW_AT_byte_size   : 1
    <392>   DW_AT_type        : <0x31>
    <396>   DW_AT_decl_file   : 6
    <397>   DW_AT_decl_line   : 50
    <398>   DW_AT_decl_column : 1
    <399>   DW_AT_sibling     : <0x3aa>
 <2><39d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39e>   DW_AT_name        : (indirect string, offset: 0x6456c): HAL_UNLOCKED
    <3a2>   DW_AT_const_value : 0
 <2><3a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x86ac3): HAL_LOCKED
    <3a8>   DW_AT_const_value : 1
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x4fd2c): HAL_LockTypeDef
    <3af>   DW_AT_decl_file   : 6
    <3b0>   DW_AT_decl_line   : 53
    <3b1>   DW_AT_decl_column : 3
    <3b2>   DW_AT_type        : <0x38f>
 <1><3b6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3b7>   DW_AT_byte_size   : 12
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 47
    <3ba>   DW_AT_decl_column : 9
    <3ba>   DW_AT_sibling     : <0x3e6>
 <2><3be>: Abbrev Number: 2 (DW_TAG_member)
    <3bf>   DW_AT_name        : (indirect string, offset: 0x5afca): PLLState
    <3c3>   DW_AT_decl_file   : 7
    <3c4>   DW_AT_decl_line   : 49
    <3c5>   DW_AT_decl_column : 12
    <3c6>   DW_AT_type        : <0x94>
    <3ca>   DW_AT_data_member_location: 0
 <2><3cb>: Abbrev Number: 2 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x5c37a): PLLSource
    <3d0>   DW_AT_decl_file   : 7
    <3d1>   DW_AT_decl_line   : 52
    <3d2>   DW_AT_decl_column : 12
    <3d3>   DW_AT_type        : <0x94>
    <3d7>   DW_AT_data_member_location: 4
 <2><3d8>: Abbrev Number: 2 (DW_TAG_member)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x797d0): PLLMUL
    <3dd>   DW_AT_decl_file   : 7
    <3de>   DW_AT_decl_line   : 55
    <3df>   DW_AT_decl_column : 12
    <3e0>   DW_AT_type        : <0x94>
    <3e4>   DW_AT_data_member_location: 8
 <2><3e5>: Abbrev Number: 0
 <1><3e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x52182): RCC_PLLInitTypeDef
    <3eb>   DW_AT_decl_file   : 7
    <3ec>   DW_AT_decl_line   : 57
    <3ed>   DW_AT_decl_column : 3
    <3ee>   DW_AT_type        : <0x3b6>
 <1><3f2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3f3>   DW_AT_byte_size   : 20
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 62
    <3f6>   DW_AT_decl_column : 9
    <3f6>   DW_AT_sibling     : <0x43c>
 <2><3fa>: Abbrev Number: 2 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x29b31): ClockType
    <3ff>   DW_AT_decl_file   : 7
    <400>   DW_AT_decl_line   : 64
    <401>   DW_AT_decl_column : 12
    <402>   DW_AT_type        : <0x94>
    <406>   DW_AT_data_member_location: 0
 <2><407>: Abbrev Number: 2 (DW_TAG_member)
    <408>   DW_AT_name        : (indirect string, offset: 0x51db1): SYSCLKSource
    <40c>   DW_AT_decl_file   : 7
    <40d>   DW_AT_decl_line   : 67
    <40e>   DW_AT_decl_column : 12
    <40f>   DW_AT_type        : <0x94>
    <413>   DW_AT_data_member_location: 4
 <2><414>: Abbrev Number: 2 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0x70686): AHBCLKDivider
    <419>   DW_AT_decl_file   : 7
    <41a>   DW_AT_decl_line   : 70
    <41b>   DW_AT_decl_column : 12
    <41c>   DW_AT_type        : <0x94>
    <420>   DW_AT_data_member_location: 8
 <2><421>: Abbrev Number: 2 (DW_TAG_member)
    <422>   DW_AT_name        : (indirect string, offset: 0x5306): APB1CLKDivider
    <426>   DW_AT_decl_file   : 7
    <427>   DW_AT_decl_line   : 73
    <428>   DW_AT_decl_column : 12
    <429>   DW_AT_type        : <0x94>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 2 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x3e79e): APB2CLKDivider
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 76
    <435>   DW_AT_decl_column : 12
    <436>   DW_AT_type        : <0x94>
    <43a>   DW_AT_data_member_location: 16
 <2><43b>: Abbrev Number: 0
 <1><43c>: Abbrev Number: 4 (DW_TAG_typedef)
    <43d>   DW_AT_name        : (indirect string, offset: 0x29b7e): RCC_ClkInitTypeDef
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 78
    <443>   DW_AT_decl_column : 3
    <444>   DW_AT_type        : <0x3f2>
 <1><448>: Abbrev Number: 10 (DW_TAG_structure_type)
    <449>   DW_AT_byte_size   : 40
    <44a>   DW_AT_decl_file   : 8
    <44b>   DW_AT_decl_line   : 226
    <44c>   DW_AT_decl_column : 9
    <44c>   DW_AT_sibling     : <0x4b9>
 <2><450>: Abbrev Number: 2 (DW_TAG_member)
    <451>   DW_AT_name        : (indirect string, offset: 0x8028): OscillatorType
    <455>   DW_AT_decl_file   : 8
    <456>   DW_AT_decl_line   : 228
    <457>   DW_AT_decl_column : 12
    <458>   DW_AT_type        : <0x94>
    <45c>   DW_AT_data_member_location: 0
 <2><45d>: Abbrev Number: 2 (DW_TAG_member)
    <45e>   DW_AT_name        : (indirect string, offset: 0x5c278): HSEState
    <462>   DW_AT_decl_file   : 8
    <463>   DW_AT_decl_line   : 236
    <464>   DW_AT_decl_column : 12
    <465>   DW_AT_type        : <0x94>
    <469>   DW_AT_data_member_location: 4
 <2><46a>: Abbrev Number: 2 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x5b6dd): HSEPredivValue
    <46f>   DW_AT_decl_file   : 8
    <470>   DW_AT_decl_line   : 239
    <471>   DW_AT_decl_column : 12
    <472>   DW_AT_type        : <0x94>
    <476>   DW_AT_data_member_location: 8
 <2><477>: Abbrev Number: 2 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0x552c9): LSEState
    <47c>   DW_AT_decl_file   : 8
    <47d>   DW_AT_decl_line   : 242
    <47e>   DW_AT_decl_column : 12
    <47f>   DW_AT_type        : <0x94>
    <483>   DW_AT_data_member_location: 12
 <2><484>: Abbrev Number: 2 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x3cda4): HSIState
    <489>   DW_AT_decl_file   : 8
    <48a>   DW_AT_decl_line   : 245
    <48b>   DW_AT_decl_column : 12
    <48c>   DW_AT_type        : <0x94>
    <490>   DW_AT_data_member_location: 16
 <2><491>: Abbrev Number: 2 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x74c64): HSICalibrationValue
    <496>   DW_AT_decl_file   : 8
    <497>   DW_AT_decl_line   : 248
    <498>   DW_AT_decl_column : 12
    <499>   DW_AT_type        : <0x94>
    <49d>   DW_AT_data_member_location: 20
 <2><49e>: Abbrev Number: 2 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x78d7f): LSIState
    <4a3>   DW_AT_decl_file   : 8
    <4a4>   DW_AT_decl_line   : 251
    <4a5>   DW_AT_decl_column : 12
    <4a6>   DW_AT_type        : <0x94>
    <4aa>   DW_AT_data_member_location: 24
 <2><4ab>: Abbrev Number: 24 (DW_TAG_member)
    <4ac>   DW_AT_name        : PLL
    <4b0>   DW_AT_decl_file   : 8
    <4b1>   DW_AT_decl_line   : 254
    <4b2>   DW_AT_decl_column : 22
    <4b3>   DW_AT_type        : <0x3e6>
    <4b7>   DW_AT_data_member_location: 28
 <2><4b8>: Abbrev Number: 0
 <1><4b9>: Abbrev Number: 9 (DW_TAG_typedef)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x480f9): RCC_OscInitTypeDef
    <4be>   DW_AT_decl_file   : 8
    <4bf>   DW_AT_decl_line   : 259
    <4c1>   DW_AT_decl_column : 3
    <4c2>   DW_AT_type        : <0x448>
 <1><4c6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <4c7>   DW_AT_byte_size   : 16
    <4c8>   DW_AT_decl_file   : 9
    <4c9>   DW_AT_decl_line   : 46
    <4ca>   DW_AT_decl_column : 9
    <4ca>   DW_AT_sibling     : <0x503>
 <2><4ce>: Abbrev Number: 24 (DW_TAG_member)
    <4cf>   DW_AT_name        : Pin
    <4d3>   DW_AT_decl_file   : 9
    <4d4>   DW_AT_decl_line   : 48
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0x94>
    <4da>   DW_AT_data_member_location: 0
 <2><4db>: Abbrev Number: 2 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x88c62): Mode
    <4e0>   DW_AT_decl_file   : 9
    <4e1>   DW_AT_decl_line   : 51
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0x94>
    <4e7>   DW_AT_data_member_location: 4
 <2><4e8>: Abbrev Number: 2 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x2aba): Pull
    <4ed>   DW_AT_decl_file   : 9
    <4ee>   DW_AT_decl_line   : 54
    <4ef>   DW_AT_decl_column : 12
    <4f0>   DW_AT_type        : <0x94>
    <4f4>   DW_AT_data_member_location: 8
 <2><4f5>: Abbrev Number: 2 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x4f672): Speed
    <4fa>   DW_AT_decl_file   : 9
    <4fb>   DW_AT_decl_line   : 57
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0x94>
    <501>   DW_AT_data_member_location: 12
 <2><502>: Abbrev Number: 0
 <1><503>: Abbrev Number: 4 (DW_TAG_typedef)
    <504>   DW_AT_name        : (indirect string, offset: 0x7cc2c): GPIO_InitTypeDef
    <508>   DW_AT_decl_file   : 9
    <509>   DW_AT_decl_line   : 59
    <50a>   DW_AT_decl_column : 3
    <50b>   DW_AT_type        : <0x4c6>
 <1><50f>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <510>   DW_AT_encoding    : 7	(unsigned)
    <511>   DW_AT_byte_size   : 1
    <512>   DW_AT_type        : <0x31>
    <516>   DW_AT_decl_file   : 9
    <517>   DW_AT_decl_line   : 65
    <518>   DW_AT_decl_column : 1
    <519>   DW_AT_sibling     : <0x52a>
 <2><51d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <51e>   DW_AT_name        : (indirect string, offset: 0x1bbf7): GPIO_PIN_RESET
    <522>   DW_AT_const_value : 0
 <2><523>: Abbrev Number: 1 (DW_TAG_enumerator)
    <524>   DW_AT_name        : (indirect string, offset: 0x17c42): GPIO_PIN_SET
    <528>   DW_AT_const_value : 1
 <2><529>: Abbrev Number: 0
 <1><52a>: Abbrev Number: 4 (DW_TAG_typedef)
    <52b>   DW_AT_name        : (indirect string, offset: 0x8455e): GPIO_PinState
    <52f>   DW_AT_decl_file   : 9
    <530>   DW_AT_decl_line   : 68
    <531>   DW_AT_decl_column : 3
    <532>   DW_AT_type        : <0x50f>
 <1><536>: Abbrev Number: 10 (DW_TAG_structure_type)
    <537>   DW_AT_byte_size   : 28
    <538>   DW_AT_decl_file   : 10
    <539>   DW_AT_decl_line   : 47
    <53a>   DW_AT_decl_column : 9
    <53a>   DW_AT_sibling     : <0x59a>
 <2><53e>: Abbrev Number: 2 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x3229a): Direction
    <543>   DW_AT_decl_file   : 10
    <544>   DW_AT_decl_line   : 49
    <545>   DW_AT_decl_column : 12
    <546>   DW_AT_type        : <0x94>
    <54a>   DW_AT_data_member_location: 0
 <2><54b>: Abbrev Number: 2 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x8f95): PeriphInc
    <550>   DW_AT_decl_file   : 10
    <551>   DW_AT_decl_line   : 53
    <552>   DW_AT_decl_column : 12
    <553>   DW_AT_type        : <0x94>
    <557>   DW_AT_data_member_location: 4
 <2><558>: Abbrev Number: 2 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x15025): MemInc
    <55d>   DW_AT_decl_file   : 10
    <55e>   DW_AT_decl_line   : 56
    <55f>   DW_AT_decl_column : 12
    <560>   DW_AT_type        : <0x94>
    <564>   DW_AT_data_member_location: 8
 <2><565>: Abbrev Number: 2 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0x43887): PeriphDataAlignment
    <56a>   DW_AT_decl_file   : 10
    <56b>   DW_AT_decl_line   : 59
    <56c>   DW_AT_decl_column : 12
    <56d>   DW_AT_type        : <0x94>
    <571>   DW_AT_data_member_location: 12
 <2><572>: Abbrev Number: 2 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x7a309): MemDataAlignment
    <577>   DW_AT_decl_file   : 10
    <578>   DW_AT_decl_line   : 62
    <579>   DW_AT_decl_column : 12
    <57a>   DW_AT_type        : <0x94>
    <57e>   DW_AT_data_member_location: 16
 <2><57f>: Abbrev Number: 2 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0x88c62): Mode
    <584>   DW_AT_decl_file   : 10
    <585>   DW_AT_decl_line   : 65
    <586>   DW_AT_decl_column : 12
    <587>   DW_AT_type        : <0x94>
    <58b>   DW_AT_data_member_location: 20
 <2><58c>: Abbrev Number: 2 (DW_TAG_member)
    <58d>   DW_AT_name        : (indirect string, offset: 0x87f8b): Priority
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 70
    <593>   DW_AT_decl_column : 12
    <594>   DW_AT_type        : <0x94>
    <598>   DW_AT_data_member_location: 24
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 4 (DW_TAG_typedef)
    <59b>   DW_AT_name        : (indirect string, offset: 0x244a5): DMA_InitTypeDef
    <59f>   DW_AT_decl_file   : 10
    <5a0>   DW_AT_decl_line   : 72
    <5a1>   DW_AT_decl_column : 3
    <5a2>   DW_AT_type        : <0x536>
 <1><5a6>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <5a7>   DW_AT_encoding    : 7	(unsigned)
    <5a8>   DW_AT_byte_size   : 1
    <5a9>   DW_AT_type        : <0x31>
    <5ad>   DW_AT_decl_file   : 10
    <5ae>   DW_AT_decl_line   : 78
    <5af>   DW_AT_decl_column : 1
    <5b0>   DW_AT_sibling     : <0x5cd>
 <2><5b4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x65492): HAL_DMA_STATE_RESET
    <5b9>   DW_AT_const_value : 0
 <2><5ba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x251c7): HAL_DMA_STATE_READY
    <5bf>   DW_AT_const_value : 1
 <2><5c0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x5e290): HAL_DMA_STATE_BUSY
    <5c5>   DW_AT_const_value : 2
 <2><5c6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x84857): HAL_DMA_STATE_TIMEOUT
    <5cb>   DW_AT_const_value : 3
 <2><5cc>: Abbrev Number: 0
 <1><5cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x5a6dd): HAL_DMA_StateTypeDef
    <5d2>   DW_AT_decl_file   : 10
    <5d3>   DW_AT_decl_line   : 83
    <5d4>   DW_AT_decl_column : 2
    <5d5>   DW_AT_type        : <0x5a6>
 <1><5d9>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <5da>   DW_AT_type        : <0x5cd>
 <1><5de>: Abbrev Number: 34 (DW_TAG_structure_type)
    <5df>   DW_AT_name        : (indirect string, offset: 0x73b16): __DMA_HandleTypeDef
    <5e3>   DW_AT_byte_size   : 68
    <5e4>   DW_AT_decl_file   : 10
    <5e5>   DW_AT_decl_line   : 110
    <5e6>   DW_AT_decl_column : 16
    <5e7>   DW_AT_sibling     : <0x688>
 <2><5eb>: Abbrev Number: 2 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x34bb8): Instance
    <5f0>   DW_AT_decl_file   : 10
    <5f1>   DW_AT_decl_line   : 112
    <5f2>   DW_AT_decl_column : 31
    <5f3>   DW_AT_type        : <0x688>
    <5f7>   DW_AT_data_member_location: 0
 <2><5f8>: Abbrev Number: 2 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x88a49): Init
    <5fd>   DW_AT_decl_file   : 10
    <5fe>   DW_AT_decl_line   : 114
    <5ff>   DW_AT_decl_column : 30
    <600>   DW_AT_type        : <0x59a>
    <604>   DW_AT_data_member_location: 4
 <2><605>: Abbrev Number: 2 (DW_TAG_member)
    <606>   DW_AT_name        : (indirect string, offset: 0x60e50): Lock
    <60a>   DW_AT_decl_file   : 10
    <60b>   DW_AT_decl_line   : 116
    <60c>   DW_AT_decl_column : 30
    <60d>   DW_AT_type        : <0x3aa>
    <611>   DW_AT_data_member_location: 32
 <2><612>: Abbrev Number: 2 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x5c27b): State
    <617>   DW_AT_decl_file   : 10
    <618>   DW_AT_decl_line   : 118
    <619>   DW_AT_decl_column : 30
    <61a>   DW_AT_type        : <0x5d9>
    <61e>   DW_AT_data_member_location: 33
 <2><61f>: Abbrev Number: 2 (DW_TAG_member)
    <620>   DW_AT_name        : (indirect string, offset: 0x80601): Parent
    <624>   DW_AT_decl_file   : 10
    <625>   DW_AT_decl_line   : 120
    <626>   DW_AT_decl_column : 31
    <627>   DW_AT_type        : <0x68d>
    <62b>   DW_AT_data_member_location: 36
 <2><62c>: Abbrev Number: 2 (DW_TAG_member)
    <62d>   DW_AT_name        : (indirect string, offset: 0x86105): XferCpltCallback
    <631>   DW_AT_decl_file   : 10
    <632>   DW_AT_decl_line   : 122
    <633>   DW_AT_decl_column : 33
    <634>   DW_AT_type        : <0x69f>
    <638>   DW_AT_data_member_location: 40
 <2><639>: Abbrev Number: 2 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0x69885): XferHalfCpltCallback
    <63e>   DW_AT_decl_file   : 10
    <63f>   DW_AT_decl_line   : 124
    <640>   DW_AT_decl_column : 33
    <641>   DW_AT_type        : <0x69f>
    <645>   DW_AT_data_member_location: 44
 <2><646>: Abbrev Number: 2 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x13231): XferErrorCallback
    <64b>   DW_AT_decl_file   : 10
    <64c>   DW_AT_decl_line   : 126
    <64d>   DW_AT_decl_column : 33
    <64e>   DW_AT_type        : <0x69f>
    <652>   DW_AT_data_member_location: 48
 <2><653>: Abbrev Number: 2 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0x7e0fe): XferAbortCallback
    <658>   DW_AT_decl_file   : 10
    <659>   DW_AT_decl_line   : 128
    <65a>   DW_AT_decl_column : 33
    <65b>   DW_AT_type        : <0x69f>
    <65f>   DW_AT_data_member_location: 52
 <2><660>: Abbrev Number: 2 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x83b89): ErrorCode
    <665>   DW_AT_decl_file   : 10
    <666>   DW_AT_decl_line   : 130
    <667>   DW_AT_decl_column : 30
    <668>   DW_AT_type        : <0xa0>
    <66c>   DW_AT_data_member_location: 56
 <2><66d>: Abbrev Number: 2 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x3a0eb): DmaBaseAddress
    <672>   DW_AT_decl_file   : 10
    <673>   DW_AT_decl_line   : 132
    <674>   DW_AT_decl_column : 31
    <675>   DW_AT_type        : <0x6a4>
    <679>   DW_AT_data_member_location: 60
 <2><67a>: Abbrev Number: 2 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x1bc88): ChannelIndex
    <67f>   DW_AT_decl_file   : 10
    <680>   DW_AT_decl_line   : 134
    <681>   DW_AT_decl_column : 30
    <682>   DW_AT_type        : <0x94>
    <686>   DW_AT_data_member_location: 64
 <2><687>: Abbrev Number: 0
 <1><688>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <689>   DW_AT_byte_size   : 4
    <689>   DW_AT_type        : <0xe5>
 <1><68d>: Abbrev Number: 35 (DW_TAG_pointer_type)
    <68e>   DW_AT_byte_size   : 4
 <1><68f>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <690>   DW_AT_prototyped  : 1
    <690>   DW_AT_sibling     : <0x69a>
 <2><694>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <695>   DW_AT_type        : <0x69a>
 <2><699>: Abbrev Number: 0
 <1><69a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <69b>   DW_AT_byte_size   : 4
    <69b>   DW_AT_type        : <0x5de>
 <1><69f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6a0>   DW_AT_byte_size   : 4
    <6a0>   DW_AT_type        : <0x68f>
 <1><6a4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6a5>   DW_AT_byte_size   : 4
    <6a5>   DW_AT_type        : <0x116>
 <1><6a9>: Abbrev Number: 4 (DW_TAG_typedef)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x73b18): DMA_HandleTypeDef
    <6ae>   DW_AT_decl_file   : 10
    <6af>   DW_AT_decl_line   : 136
    <6b0>   DW_AT_decl_column : 3
    <6b1>   DW_AT_type        : <0x5de>
 <1><6b5>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6b6>   DW_AT_byte_size   : 24
    <6b7>   DW_AT_decl_file   : 11
    <6b8>   DW_AT_decl_line   : 46
    <6b9>   DW_AT_decl_column : 9
    <6b9>   DW_AT_sibling     : <0x70c>
 <2><6bd>: Abbrev Number: 2 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x87966): Prescaler
    <6c2>   DW_AT_decl_file   : 11
    <6c3>   DW_AT_decl_line   : 48
    <6c4>   DW_AT_decl_column : 12
    <6c5>   DW_AT_type        : <0x94>
    <6c9>   DW_AT_data_member_location: 0
 <2><6ca>: Abbrev Number: 2 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x7aea7): CounterMode
    <6cf>   DW_AT_decl_file   : 11
    <6d0>   DW_AT_decl_line   : 51
    <6d1>   DW_AT_decl_column : 12
    <6d2>   DW_AT_type        : <0x94>
    <6d6>   DW_AT_data_member_location: 4
 <2><6d7>: Abbrev Number: 2 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x9090c): Period
    <6dc>   DW_AT_decl_file   : 11
    <6dd>   DW_AT_decl_line   : 54
    <6de>   DW_AT_decl_column : 12
    <6df>   DW_AT_type        : <0x94>
    <6e3>   DW_AT_data_member_location: 8
 <2><6e4>: Abbrev Number: 2 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x373a1): ClockDivision
    <6e9>   DW_AT_decl_file   : 11
    <6ea>   DW_AT_decl_line   : 58
    <6eb>   DW_AT_decl_column : 12
    <6ec>   DW_AT_type        : <0x94>
    <6f0>   DW_AT_data_member_location: 12
 <2><6f1>: Abbrev Number: 2 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x5f3f5): RepetitionCounter
    <6f6>   DW_AT_decl_file   : 11
    <6f7>   DW_AT_decl_line   : 61
    <6f8>   DW_AT_decl_column : 12
    <6f9>   DW_AT_type        : <0x94>
    <6fd>   DW_AT_data_member_location: 16
 <2><6fe>: Abbrev Number: 2 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xd7db): AutoReloadPreload
    <703>   DW_AT_decl_file   : 11
    <704>   DW_AT_decl_line   : 72
    <705>   DW_AT_decl_column : 12
    <706>   DW_AT_type        : <0x94>
    <70a>   DW_AT_data_member_location: 20
 <2><70b>: Abbrev Number: 0
 <1><70c>: Abbrev Number: 4 (DW_TAG_typedef)
    <70d>   DW_AT_name        : (indirect string, offset: 0x7937b): TIM_Base_InitTypeDef
    <711>   DW_AT_decl_file   : 11
    <712>   DW_AT_decl_line   : 74
    <713>   DW_AT_decl_column : 3
    <714>   DW_AT_type        : <0x6b5>
 <1><718>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <719>   DW_AT_encoding    : 7	(unsigned)
    <719>   DW_AT_byte_size   : 1
    <719>   DW_AT_type        : <0x31>
    <71d>   DW_AT_decl_file   : 11
    <71d>   DW_AT_decl_line   : 291
    <71f>   DW_AT_decl_column : 1
    <71f>   DW_AT_sibling     : <0x742>
 <2><723>: Abbrev Number: 1 (DW_TAG_enumerator)
    <724>   DW_AT_name        : (indirect string, offset: 0x445b2): HAL_TIM_STATE_RESET
    <728>   DW_AT_const_value : 0
 <2><729>: Abbrev Number: 1 (DW_TAG_enumerator)
    <72a>   DW_AT_name        : (indirect string, offset: 0x4e3c): HAL_TIM_STATE_READY
    <72e>   DW_AT_const_value : 1
 <2><72f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <730>   DW_AT_name        : (indirect string, offset: 0x220bb): HAL_TIM_STATE_BUSY
    <734>   DW_AT_const_value : 2
 <2><735>: Abbrev Number: 1 (DW_TAG_enumerator)
    <736>   DW_AT_name        : (indirect string, offset: 0x71bba): HAL_TIM_STATE_TIMEOUT
    <73a>   DW_AT_const_value : 3
 <2><73b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <73c>   DW_AT_name        : (indirect string, offset: 0x31920): HAL_TIM_STATE_ERROR
    <740>   DW_AT_const_value : 4
 <2><741>: Abbrev Number: 0
 <1><742>: Abbrev Number: 9 (DW_TAG_typedef)
    <743>   DW_AT_name        : (indirect string, offset: 0x626f1): HAL_TIM_StateTypeDef
    <747>   DW_AT_decl_file   : 11
    <748>   DW_AT_decl_line   : 297
    <74a>   DW_AT_decl_column : 3
    <74b>   DW_AT_type        : <0x718>
 <1><74f>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <750>   DW_AT_type        : <0x742>
 <1><754>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <755>   DW_AT_encoding    : 7	(unsigned)
    <755>   DW_AT_byte_size   : 1
    <755>   DW_AT_type        : <0x31>
    <759>   DW_AT_decl_file   : 11
    <759>   DW_AT_decl_line   : 303
    <75b>   DW_AT_decl_column : 1
    <75b>   DW_AT_sibling     : <0x772>
 <2><75f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <760>   DW_AT_name        : (indirect string, offset: 0x30334): HAL_TIM_CHANNEL_STATE_RESET
    <764>   DW_AT_const_value : 0
 <2><765>: Abbrev Number: 1 (DW_TAG_enumerator)
    <766>   DW_AT_name        : (indirect string, offset: 0x4f8ea): HAL_TIM_CHANNEL_STATE_READY
    <76a>   DW_AT_const_value : 1
 <2><76b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <76c>   DW_AT_name        : (indirect string, offset: 0x417d0): HAL_TIM_CHANNEL_STATE_BUSY
    <770>   DW_AT_const_value : 2
 <2><771>: Abbrev Number: 0
 <1><772>: Abbrev Number: 9 (DW_TAG_typedef)
    <773>   DW_AT_name        : (indirect string, offset: 0x1c2ef): HAL_TIM_ChannelStateTypeDef
    <777>   DW_AT_decl_file   : 11
    <778>   DW_AT_decl_line   : 307
    <77a>   DW_AT_decl_column : 3
    <77b>   DW_AT_type        : <0x754>
 <1><77f>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <780>   DW_AT_type        : <0x772>
 <1><784>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <785>   DW_AT_encoding    : 7	(unsigned)
    <785>   DW_AT_byte_size   : 1
    <785>   DW_AT_type        : <0x31>
    <789>   DW_AT_decl_file   : 11
    <789>   DW_AT_decl_line   : 313
    <78b>   DW_AT_decl_column : 1
    <78b>   DW_AT_sibling     : <0x7a2>
 <2><78f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <790>   DW_AT_name        : (indirect string, offset: 0x2bc4): HAL_DMA_BURST_STATE_RESET
    <794>   DW_AT_const_value : 0
 <2><795>: Abbrev Number: 1 (DW_TAG_enumerator)
    <796>   DW_AT_name        : (indirect string, offset: 0x4aae8): HAL_DMA_BURST_STATE_READY
    <79a>   DW_AT_const_value : 1
 <2><79b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <79c>   DW_AT_name        : (indirect string, offset: 0x65e9a): HAL_DMA_BURST_STATE_BUSY
    <7a0>   DW_AT_const_value : 2
 <2><7a1>: Abbrev Number: 0
 <1><7a2>: Abbrev Number: 9 (DW_TAG_typedef)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x11fa5): HAL_TIM_DMABurstStateTypeDef
    <7a7>   DW_AT_decl_file   : 11
    <7a8>   DW_AT_decl_line   : 317
    <7aa>   DW_AT_decl_column : 3
    <7ab>   DW_AT_type        : <0x784>
 <1><7af>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <7b0>   DW_AT_type        : <0x7a2>
 <1><7b4>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <7b5>   DW_AT_encoding    : 7	(unsigned)
    <7b5>   DW_AT_byte_size   : 1
    <7b5>   DW_AT_type        : <0x31>
    <7b9>   DW_AT_decl_file   : 11
    <7b9>   DW_AT_decl_line   : 323
    <7bb>   DW_AT_decl_column : 1
    <7bb>   DW_AT_sibling     : <0x7de>
 <2><7bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x4c0a9): HAL_TIM_ACTIVE_CHANNEL_1
    <7c4>   DW_AT_const_value : 1
 <2><7c5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x4c0c2): HAL_TIM_ACTIVE_CHANNEL_2
    <7ca>   DW_AT_const_value : 2
 <2><7cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x4c0db): HAL_TIM_ACTIVE_CHANNEL_3
    <7d0>   DW_AT_const_value : 4
 <2><7d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x4c0f4): HAL_TIM_ACTIVE_CHANNEL_4
    <7d6>   DW_AT_const_value : 8
 <2><7d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x38080): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <7dc>   DW_AT_const_value : 0
 <2><7dd>: Abbrev Number: 0
 <1><7de>: Abbrev Number: 9 (DW_TAG_typedef)
    <7df>   DW_AT_name        : (indirect string, offset: 0x1b590): HAL_TIM_ActiveChannel
    <7e3>   DW_AT_decl_file   : 11
    <7e4>   DW_AT_decl_line   : 329
    <7e6>   DW_AT_decl_column : 3
    <7e7>   DW_AT_type        : <0x7b4>
 <1><7eb>: Abbrev Number: 13 (DW_TAG_structure_type)
    <7ec>   DW_AT_byte_size   : 72
    <7ed>   DW_AT_decl_file   : 11
    <7ee>   DW_AT_decl_line   : 337
    <7f0>   DW_AT_decl_column : 9
    <7f0>   DW_AT_sibling     : <0x873>
 <2><7f4>: Abbrev Number: 3 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x34bb8): Instance
    <7f9>   DW_AT_decl_file   : 11
    <7fa>   DW_AT_decl_line   : 340
    <7fc>   DW_AT_decl_column : 39
    <7fd>   DW_AT_type        : <0x873>
    <801>   DW_AT_data_member_location: 0
 <2><802>: Abbrev Number: 3 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x88a49): Init
    <807>   DW_AT_decl_file   : 11
    <808>   DW_AT_decl_line   : 341
    <80a>   DW_AT_decl_column : 38
    <80b>   DW_AT_type        : <0x70c>
    <80f>   DW_AT_data_member_location: 4
 <2><810>: Abbrev Number: 3 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0x1b59e): Channel
    <815>   DW_AT_decl_file   : 11
    <816>   DW_AT_decl_line   : 342
    <818>   DW_AT_decl_column : 38
    <819>   DW_AT_type        : <0x7de>
    <81d>   DW_AT_data_member_location: 28
 <2><81e>: Abbrev Number: 3 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0x516f9): hdma
    <823>   DW_AT_decl_file   : 11
    <824>   DW_AT_decl_line   : 343
    <826>   DW_AT_decl_column : 39
    <827>   DW_AT_type        : <0x878>
    <82b>   DW_AT_data_member_location: 32
 <2><82c>: Abbrev Number: 3 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x60e50): Lock
    <831>   DW_AT_decl_file   : 11
    <832>   DW_AT_decl_line   : 345
    <834>   DW_AT_decl_column : 38
    <835>   DW_AT_type        : <0x3aa>
    <839>   DW_AT_data_member_location: 60
 <2><83a>: Abbrev Number: 3 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x5c27b): State
    <83f>   DW_AT_decl_file   : 11
    <840>   DW_AT_decl_line   : 346
    <842>   DW_AT_decl_column : 38
    <843>   DW_AT_type        : <0x74f>
    <847>   DW_AT_data_member_location: 61
 <2><848>: Abbrev Number: 3 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x892e2): ChannelState
    <84d>   DW_AT_decl_file   : 11
    <84e>   DW_AT_decl_line   : 347
    <850>   DW_AT_decl_column : 38
    <851>   DW_AT_type        : <0x89d>
    <855>   DW_AT_data_member_location: 62
 <2><856>: Abbrev Number: 3 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x898e5): ChannelNState
    <85b>   DW_AT_decl_file   : 11
    <85c>   DW_AT_decl_line   : 348
    <85e>   DW_AT_decl_column : 38
    <85f>   DW_AT_type        : <0x89d>
    <863>   DW_AT_data_member_location: 66
 <2><864>: Abbrev Number: 3 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0x88e40): DMABurstState
    <869>   DW_AT_decl_file   : 11
    <86a>   DW_AT_decl_line   : 349
    <86c>   DW_AT_decl_column : 38
    <86d>   DW_AT_type        : <0x7af>
    <871>   DW_AT_data_member_location: 70
 <2><872>: Abbrev Number: 0
 <1><873>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <874>   DW_AT_byte_size   : 4
    <874>   DW_AT_type        : <0x348>
 <1><878>: Abbrev Number: 26 (DW_TAG_array_type)
    <879>   DW_AT_type        : <0x888>
    <87d>   DW_AT_sibling     : <0x888>
 <2><881>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <882>   DW_AT_type        : <0x81>
    <886>   DW_AT_upper_bound : 6
 <2><887>: Abbrev Number: 0
 <1><888>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <889>   DW_AT_byte_size   : 4
    <889>   DW_AT_type        : <0x6a9>
 <1><88d>: Abbrev Number: 26 (DW_TAG_array_type)
    <88e>   DW_AT_type        : <0x77f>
    <892>   DW_AT_sibling     : <0x89d>
 <2><896>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <897>   DW_AT_type        : <0x81>
    <89b>   DW_AT_upper_bound : 3
 <2><89c>: Abbrev Number: 0
 <1><89d>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <89e>   DW_AT_type        : <0x88d>
 <1><8a2>: Abbrev Number: 9 (DW_TAG_typedef)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x2e930): TIM_HandleTypeDef
    <8a7>   DW_AT_decl_file   : 11
    <8a8>   DW_AT_decl_line   : 380
    <8aa>   DW_AT_decl_column : 3
    <8ab>   DW_AT_type        : <0x7eb>
 <1><8af>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <8b0>   DW_AT_encoding    : 5	(signed)
    <8b1>   DW_AT_byte_size   : 4
    <8b2>   DW_AT_type        : <0x7a>
    <8b6>   DW_AT_decl_file   : 12
    <8b7>   DW_AT_decl_line   : 82
    <8b8>   DW_AT_decl_column : 14
    <8b9>   DW_AT_sibling     : <0x9fb>
 <2><8bd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8be>   DW_AT_name        : (indirect string, offset: 0x28942): osPriorityNone
    <8c2>   DW_AT_const_value : 0
 <2><8c3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8c4>   DW_AT_name        : (indirect string, offset: 0x75b17): osPriorityIdle
    <8c8>   DW_AT_const_value : 1
 <2><8c9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ca>   DW_AT_name        : (indirect string, offset: 0x7f9a8): osPriorityLow
    <8ce>   DW_AT_const_value : 8
 <2><8cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x1e485): osPriorityLow1
    <8d4>   DW_AT_const_value : 9
 <2><8d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x800a4): osPriorityLow2
    <8da>   DW_AT_const_value : 10
 <2><8db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8dc>   DW_AT_name        : (indirect string, offset: 0x800b3): osPriorityLow3
    <8e0>   DW_AT_const_value : 11
 <2><8e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x800c2): osPriorityLow4
    <8e6>   DW_AT_const_value : 12
 <2><8e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x32683): osPriorityLow5
    <8ec>   DW_AT_const_value : 13
 <2><8ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x800fd): osPriorityLow6
    <8f2>   DW_AT_const_value : 14
 <2><8f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8f4>   DW_AT_name        : (indirect string, offset: 0x8010c): osPriorityLow7
    <8f8>   DW_AT_const_value : 15
 <2><8f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x81aee): osPriorityBelowNormal
    <8fe>   DW_AT_const_value : 16
 <2><8ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <900>   DW_AT_name        : (indirect string, offset: 0x46239): osPriorityBelowNormal1
    <904>   DW_AT_const_value : 17
 <2><905>: Abbrev Number: 1 (DW_TAG_enumerator)
    <906>   DW_AT_name        : (indirect string, offset: 0x73444): osPriorityBelowNormal2
    <90a>   DW_AT_const_value : 18
 <2><90b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <90c>   DW_AT_name        : (indirect string, offset: 0x5ca3c): osPriorityBelowNormal3
    <910>   DW_AT_const_value : 19
 <2><911>: Abbrev Number: 1 (DW_TAG_enumerator)
    <912>   DW_AT_name        : (indirect string, offset: 0x73479): osPriorityBelowNormal4
    <916>   DW_AT_const_value : 20
 <2><917>: Abbrev Number: 1 (DW_TAG_enumerator)
    <918>   DW_AT_name        : (indirect string, offset: 0x73490): osPriorityBelowNormal5
    <91c>   DW_AT_const_value : 21
 <2><91d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0x734a7): osPriorityBelowNormal6
    <922>   DW_AT_const_value : 22
 <2><923>: Abbrev Number: 1 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x734be): osPriorityBelowNormal7
    <928>   DW_AT_const_value : 23
 <2><929>: Abbrev Number: 1 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x6ec06): osPriorityNormal
    <92e>   DW_AT_const_value : 24
 <2><92f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x1597d): osPriorityNormal1
    <934>   DW_AT_const_value : 25
 <2><935>: Abbrev Number: 1 (DW_TAG_enumerator)
    <936>   DW_AT_name        : (indirect string, offset: 0x1598f): osPriorityNormal2
    <93a>   DW_AT_const_value : 26
 <2><93b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <93c>   DW_AT_name        : (indirect string, offset: 0x159a1): osPriorityNormal3
    <940>   DW_AT_const_value : 27
 <2><941>: Abbrev Number: 1 (DW_TAG_enumerator)
    <942>   DW_AT_name        : (indirect string, offset: 0x159b3): osPriorityNormal4
    <946>   DW_AT_const_value : 28
 <2><947>: Abbrev Number: 1 (DW_TAG_enumerator)
    <948>   DW_AT_name        : (indirect string, offset: 0x159c5): osPriorityNormal5
    <94c>   DW_AT_const_value : 29
 <2><94d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <94e>   DW_AT_name        : (indirect string, offset: 0x159d7): osPriorityNormal6
    <952>   DW_AT_const_value : 30
 <2><953>: Abbrev Number: 1 (DW_TAG_enumerator)
    <954>   DW_AT_name        : (indirect string, offset: 0x159e9): osPriorityNormal7
    <958>   DW_AT_const_value : 31
 <2><959>: Abbrev Number: 1 (DW_TAG_enumerator)
    <95a>   DW_AT_name        : (indirect string, offset: 0x21284): osPriorityAboveNormal
    <95e>   DW_AT_const_value : 32
 <2><95f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <960>   DW_AT_name        : (indirect string, offset: 0x8671b): osPriorityAboveNormal1
    <964>   DW_AT_const_value : 33
 <2><965>: Abbrev Number: 1 (DW_TAG_enumerator)
    <966>   DW_AT_name        : (indirect string, offset: 0x86732): osPriorityAboveNormal2
    <96a>   DW_AT_const_value : 34
 <2><96b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <96c>   DW_AT_name        : (indirect string, offset: 0x86749): osPriorityAboveNormal3
    <970>   DW_AT_const_value : 35
 <2><971>: Abbrev Number: 1 (DW_TAG_enumerator)
    <972>   DW_AT_name        : (indirect string, offset: 0x86760): osPriorityAboveNormal4
    <976>   DW_AT_const_value : 36
 <2><977>: Abbrev Number: 1 (DW_TAG_enumerator)
    <978>   DW_AT_name        : (indirect string, offset: 0x7f109): osPriorityAboveNormal5
    <97c>   DW_AT_const_value : 37
 <2><97d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <97e>   DW_AT_name        : (indirect string, offset: 0x8678d): osPriorityAboveNormal6
    <982>   DW_AT_const_value : 38
 <2><983>: Abbrev Number: 1 (DW_TAG_enumerator)
    <984>   DW_AT_name        : (indirect string, offset: 0x867a4): osPriorityAboveNormal7
    <988>   DW_AT_const_value : 39
 <2><989>: Abbrev Number: 1 (DW_TAG_enumerator)
    <98a>   DW_AT_name        : (indirect string, offset: 0x75090): osPriorityHigh
    <98e>   DW_AT_const_value : 40
 <2><98f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <990>   DW_AT_name        : (indirect string, offset: 0x59e3b): osPriorityHigh1
    <994>   DW_AT_const_value : 41
 <2><995>: Abbrev Number: 1 (DW_TAG_enumerator)
    <996>   DW_AT_name        : (indirect string, offset: 0x59e4b): osPriorityHigh2
    <99a>   DW_AT_const_value : 42
 <2><99b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <99c>   DW_AT_name        : (indirect string, offset: 0x59e5b): osPriorityHigh3
    <9a0>   DW_AT_const_value : 43
 <2><9a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x59e6b): osPriorityHigh4
    <9a6>   DW_AT_const_value : 44
 <2><9a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x2afb): osPriorityHigh5
    <9ac>   DW_AT_const_value : 45
 <2><9ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x59ea7): osPriorityHigh6
    <9b2>   DW_AT_const_value : 46
 <2><9b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b4>   DW_AT_name        : (indirect string, offset: 0x59eb7): osPriorityHigh7
    <9b8>   DW_AT_const_value : 47
 <2><9b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x7ab17): osPriorityRealtime
    <9be>   DW_AT_const_value : 48
 <2><9bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x54fde): osPriorityRealtime1
    <9c4>   DW_AT_const_value : 49
 <2><9c5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x54ff2): osPriorityRealtime2
    <9ca>   DW_AT_const_value : 50
 <2><9cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9cc>   DW_AT_name        : (indirect string, offset: 0x55006): osPriorityRealtime3
    <9d0>   DW_AT_const_value : 51
 <2><9d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x5501a): osPriorityRealtime4
    <9d6>   DW_AT_const_value : 52
 <2><9d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x5502e): osPriorityRealtime5
    <9dc>   DW_AT_const_value : 53
 <2><9dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9de>   DW_AT_name        : (indirect string, offset: 0x55042): osPriorityRealtime6
    <9e2>   DW_AT_const_value : 54
 <2><9e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x55056): osPriorityRealtime7
    <9e8>   DW_AT_const_value : 55
 <2><9e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x3d477): osPriorityISR
    <9ee>   DW_AT_const_value : 56
 <2><9ef>: Abbrev Number: 11 (DW_TAG_enumerator)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x778d1): osPriorityError
    <9f4>   DW_AT_const_value : -1
 <2><9f5>: Abbrev Number: 28 (DW_TAG_enumerator)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x74e96): osPriorityReserved
    <9fa>   DW_AT_const_value : 2147483647
 <2><9fa>: Abbrev Number: 0
 <1><9fb>: Abbrev Number: 4 (DW_TAG_typedef)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x1ec67): osPriority_t
    <a00>   DW_AT_decl_file   : 12
    <a01>   DW_AT_decl_line   : 136
    <a02>   DW_AT_decl_column : 3
    <a03>   DW_AT_type        : <0x8af>
 <1><a07>: Abbrev Number: 4 (DW_TAG_typedef)
    <a08>   DW_AT_name        : (indirect string, offset: 0x4956c): osThreadFunc_t
    <a0c>   DW_AT_decl_file   : 12
    <a0d>   DW_AT_decl_line   : 139
    <a0e>   DW_AT_decl_column : 16
    <a0f>   DW_AT_type        : <0xa13>
 <1><a13>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a14>   DW_AT_byte_size   : 4
    <a14>   DW_AT_type        : <0xa18>
 <1><a18>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <a19>   DW_AT_prototyped  : 1
    <a19>   DW_AT_sibling     : <0xa23>
 <2><a1d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a1e>   DW_AT_type        : <0x68d>
 <2><a22>: Abbrev Number: 0
 <1><a23>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <a24>   DW_AT_encoding    : 5	(signed)
    <a25>   DW_AT_byte_size   : 4
    <a26>   DW_AT_type        : <0x7a>
    <a2a>   DW_AT_decl_file   : 12
    <a2b>   DW_AT_decl_line   : 176
    <a2c>   DW_AT_decl_column : 14
    <a2d>   DW_AT_sibling     : <0xa61>
 <2><a31>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a32>   DW_AT_name        : (indirect string, offset: 0x77716): osOK
    <a36>   DW_AT_const_value : 0
 <2><a37>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a38>   DW_AT_name        : (indirect string, offset: 0x3eec2): osError
    <a3c>   DW_AT_const_value : -1
 <2><a3d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x7a053): osErrorTimeout
    <a42>   DW_AT_const_value : -2
 <2><a43>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a44>   DW_AT_name        : (indirect string, offset: 0x58a2a): osErrorResource
    <a48>   DW_AT_const_value : -3
 <2><a49>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x232a9): osErrorParameter
    <a4e>   DW_AT_const_value : -4
 <2><a4f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a50>   DW_AT_name        : (indirect string, offset: 0x17643): osErrorNoMemory
    <a54>   DW_AT_const_value : -5
 <2><a55>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a56>   DW_AT_name        : (indirect string, offset: 0x247fd): osErrorISR
    <a5a>   DW_AT_const_value : -6
 <2><a5b>: Abbrev Number: 28 (DW_TAG_enumerator)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x44540): osStatusReserved
    <a60>   DW_AT_const_value : 2147483647
 <2><a60>: Abbrev Number: 0
 <1><a61>: Abbrev Number: 4 (DW_TAG_typedef)
    <a62>   DW_AT_name        : (indirect string, offset: 0x2e386): osStatus_t
    <a66>   DW_AT_decl_file   : 12
    <a67>   DW_AT_decl_line   : 185
    <a68>   DW_AT_decl_column : 3
    <a69>   DW_AT_type        : <0xa23>
 <1><a6d>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x30541): osThreadId_t
    <a72>   DW_AT_decl_file   : 12
    <a73>   DW_AT_decl_line   : 189
    <a74>   DW_AT_decl_column : 15
    <a75>   DW_AT_type        : <0x68d>
 <1><a79>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x5b34e): TZ_ModuleId_t
    <a7e>   DW_AT_decl_file   : 12
    <a7f>   DW_AT_decl_line   : 213
    <a80>   DW_AT_decl_column : 18
    <a81>   DW_AT_type        : <0x94>
 <1><a85>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a86>   DW_AT_byte_size   : 36
    <a87>   DW_AT_decl_file   : 12
    <a88>   DW_AT_decl_line   : 218
    <a89>   DW_AT_decl_column : 9
    <a89>   DW_AT_sibling     : <0xb03>
 <2><a8d>: Abbrev Number: 2 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x790bd): name
    <a92>   DW_AT_decl_file   : 12
    <a93>   DW_AT_decl_line   : 219
    <a94>   DW_AT_decl_column : 33
    <a95>   DW_AT_type        : <0xb03>
    <a99>   DW_AT_data_member_location: 0
 <2><a9a>: Abbrev Number: 2 (DW_TAG_member)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x58886): attr_bits
    <a9f>   DW_AT_decl_file   : 12
    <aa0>   DW_AT_decl_line   : 220
    <aa1>   DW_AT_decl_column : 28
    <aa2>   DW_AT_type        : <0x94>
    <aa6>   DW_AT_data_member_location: 4
 <2><aa7>: Abbrev Number: 2 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x1a4eb): cb_mem
    <aac>   DW_AT_decl_file   : 12
    <aad>   DW_AT_decl_line   : 221
    <aae>   DW_AT_decl_column : 30
    <aaf>   DW_AT_type        : <0x68d>
    <ab3>   DW_AT_data_member_location: 8
 <2><ab4>: Abbrev Number: 2 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0xf0dc): cb_size
    <ab9>   DW_AT_decl_file   : 12
    <aba>   DW_AT_decl_line   : 222
    <abb>   DW_AT_decl_column : 30
    <abc>   DW_AT_type        : <0x94>
    <ac0>   DW_AT_data_member_location: 12
 <2><ac1>: Abbrev Number: 2 (DW_TAG_member)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x7b071): stack_mem
    <ac6>   DW_AT_decl_file   : 12
    <ac7>   DW_AT_decl_line   : 223
    <ac8>   DW_AT_decl_column : 27
    <ac9>   DW_AT_type        : <0x68d>
    <acd>   DW_AT_data_member_location: 16
 <2><ace>: Abbrev Number: 2 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x5506a): stack_size
    <ad3>   DW_AT_decl_file   : 12
    <ad4>   DW_AT_decl_line   : 224
    <ad5>   DW_AT_decl_column : 27
    <ad6>   DW_AT_type        : <0x94>
    <ada>   DW_AT_data_member_location: 20
 <2><adb>: Abbrev Number: 2 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0x35a0a): priority
    <ae0>   DW_AT_decl_file   : 12
    <ae1>   DW_AT_decl_line   : 225
    <ae2>   DW_AT_decl_column : 29
    <ae3>   DW_AT_type        : <0x9fb>
    <ae7>   DW_AT_data_member_location: 24
 <2><ae8>: Abbrev Number: 2 (DW_TAG_member)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x3a2d4): tz_module
    <aed>   DW_AT_decl_file   : 12
    <aee>   DW_AT_decl_line   : 226
    <aef>   DW_AT_decl_column : 28
    <af0>   DW_AT_type        : <0xa79>
    <af4>   DW_AT_data_member_location: 28
 <2><af5>: Abbrev Number: 2 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0x7989c): reserved
    <afa>   DW_AT_decl_file   : 12
    <afb>   DW_AT_decl_line   : 227
    <afc>   DW_AT_decl_column : 29
    <afd>   DW_AT_type        : <0x94>
    <b01>   DW_AT_data_member_location: 32
 <2><b02>: Abbrev Number: 0
 <1><b03>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b04>   DW_AT_byte_size   : 4
    <b04>   DW_AT_type        : <0xb0f>
 <1><b08>: Abbrev Number: 8 (DW_TAG_base_type)
    <b09>   DW_AT_byte_size   : 1
    <b0a>   DW_AT_encoding    : 8	(unsigned char)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x2bea0): char
 <1><b0f>: Abbrev Number: 29 (DW_TAG_const_type)
    <b10>   DW_AT_type        : <0xb08>
 <1><b14>: Abbrev Number: 4 (DW_TAG_typedef)
    <b15>   DW_AT_name        : (indirect string, offset: 0x2b9bd): osThreadAttr_t
    <b19>   DW_AT_decl_file   : 12
    <b1a>   DW_AT_decl_line   : 228
    <b1b>   DW_AT_decl_column : 3
    <b1c>   DW_AT_type        : <0xa85>
 <1><b20>: Abbrev Number: 29 (DW_TAG_const_type)
    <b21>   DW_AT_type        : <0xb14>
 <1><b25>: Abbrev Number: 15 (DW_TAG_variable)
    <b26>   DW_AT_name        : (indirect string, offset: 0x35e27): defaultTaskHandle
    <b2a>   DW_AT_decl_file   : 1
    <b2a>   DW_AT_decl_line   : 45
    <b2b>   DW_AT_decl_column : 14
    <b2c>   DW_AT_type        : <0xa6d>
    <b30>   DW_AT_external    : 1
    <b30>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><b36>: Abbrev Number: 15 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0x3c831): defaultTask_attributes
    <b3b>   DW_AT_decl_file   : 1
    <b3b>   DW_AT_decl_line   : 46
    <b3c>   DW_AT_decl_column : 22
    <b3d>   DW_AT_type        : <0xb20>
    <b41>   DW_AT_external    : 1
    <b41>   DW_AT_location    : 5 byte block: 3 bc 44 0 8 	(DW_OP_addr: 80044bc)
 <1><b47>: Abbrev Number: 15 (DW_TAG_variable)
    <b48>   DW_AT_name        : (indirect string, offset: 0xa3bb): FlashRedHandle
    <b4c>   DW_AT_decl_file   : 1
    <b4c>   DW_AT_decl_line   : 52
    <b4d>   DW_AT_decl_column : 14
    <b4e>   DW_AT_type        : <0xa6d>
    <b52>   DW_AT_external    : 1
    <b52>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><b58>: Abbrev Number: 15 (DW_TAG_variable)
    <b59>   DW_AT_name        : (indirect string, offset: 0x7c86c): FlashRed_attributes
    <b5d>   DW_AT_decl_file   : 1
    <b5d>   DW_AT_decl_line   : 53
    <b5e>   DW_AT_decl_column : 22
    <b5f>   DW_AT_type        : <0xb20>
    <b63>   DW_AT_external    : 1
    <b63>   DW_AT_location    : 5 byte block: 3 e0 44 0 8 	(DW_OP_addr: 80044e0)
 <1><b69>: Abbrev Number: 15 (DW_TAG_variable)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x6af7d): FlashGreenHandle
    <b6e>   DW_AT_decl_file   : 1
    <b6e>   DW_AT_decl_line   : 59
    <b6f>   DW_AT_decl_column : 14
    <b70>   DW_AT_type        : <0xa6d>
    <b74>   DW_AT_external    : 1
    <b74>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><b7a>: Abbrev Number: 15 (DW_TAG_variable)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x647e4): FlashGreen_attributes
    <b7f>   DW_AT_decl_file   : 1
    <b7f>   DW_AT_decl_line   : 60
    <b80>   DW_AT_decl_column : 22
    <b81>   DW_AT_type        : <0xb20>
    <b85>   DW_AT_external    : 1
    <b85>   DW_AT_location    : 5 byte block: 3 4 45 0 8 	(DW_OP_addr: 8004504)
 <1><b8b>: Abbrev Number: 36 (DW_TAG_subprogram)
    <b8c>   DW_AT_external    : 1
    <b8c>   DW_AT_name        : (indirect string, offset: 0x2e031): HAL_IncTick
    <b90>   DW_AT_decl_file   : 13
    <b91>   DW_AT_decl_line   : 295
    <b93>   DW_AT_decl_column : 6
    <b94>   DW_AT_prototyped  : 1
    <b94>   DW_AT_declaration : 1
 <1><b94>: Abbrev Number: 19 (DW_TAG_subprogram)
    <b95>   DW_AT_external    : 1
    <b95>   DW_AT_name        : (indirect string, offset: 0x2989b): HAL_GPIO_TogglePin
    <b99>   DW_AT_decl_file   : 9
    <b99>   DW_AT_decl_line   : 235
    <b9a>   DW_AT_decl_column : 6
    <b9b>   DW_AT_prototyped  : 1
    <b9b>   DW_AT_declaration : 1
    <b9b>   DW_AT_sibling     : <0xbaa>
 <2><b9f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ba0>   DW_AT_type        : <0xbaa>
 <2><ba4>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ba5>   DW_AT_type        : <0x88>
 <2><ba9>: Abbrev Number: 0
 <1><baa>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bab>   DW_AT_byte_size   : 4
    <bab>   DW_AT_type        : <0x185>
 <1><baf>: Abbrev Number: 17 (DW_TAG_subprogram)
    <bb0>   DW_AT_external    : 1
    <bb0>   DW_AT_name        : (indirect string, offset: 0x6f4cb): osDelay
    <bb4>   DW_AT_decl_file   : 12
    <bb5>   DW_AT_decl_line   : 459
    <bb7>   DW_AT_decl_column : 12
    <bb8>   DW_AT_prototyped  : 1
    <bb8>   DW_AT_type        : <0xa61>
    <bbc>   DW_AT_declaration : 1
    <bbc>   DW_AT_sibling     : <0xbc6>
 <2><bc0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bc1>   DW_AT_type        : <0x94>
 <2><bc5>: Abbrev Number: 0
 <1><bc6>: Abbrev Number: 19 (DW_TAG_subprogram)
    <bc7>   DW_AT_external    : 1
    <bc7>   DW_AT_name        : (indirect string, offset: 0x53483): HAL_GPIO_Init
    <bcb>   DW_AT_decl_file   : 9
    <bcb>   DW_AT_decl_line   : 223
    <bcc>   DW_AT_decl_column : 7
    <bcd>   DW_AT_prototyped  : 1
    <bcd>   DW_AT_declaration : 1
    <bcd>   DW_AT_sibling     : <0xbdc>
 <2><bd1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bd2>   DW_AT_type        : <0xbaa>
 <2><bd6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bd7>   DW_AT_type        : <0xbdc>
 <2><bdb>: Abbrev Number: 0
 <1><bdc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bdd>   DW_AT_byte_size   : 4
    <bdd>   DW_AT_type        : <0x503>
 <1><be1>: Abbrev Number: 19 (DW_TAG_subprogram)
    <be2>   DW_AT_external    : 1
    <be2>   DW_AT_name        : (indirect string, offset: 0x17fe5): HAL_GPIO_WritePin
    <be6>   DW_AT_decl_file   : 9
    <be6>   DW_AT_decl_line   : 234
    <be7>   DW_AT_decl_column : 6
    <be8>   DW_AT_prototyped  : 1
    <be8>   DW_AT_declaration : 1
    <be8>   DW_AT_sibling     : <0xbfc>
 <2><bec>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bed>   DW_AT_type        : <0xbaa>
 <2><bf1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bf2>   DW_AT_type        : <0x88>
 <2><bf6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bf7>   DW_AT_type        : <0x52a>
 <2><bfb>: Abbrev Number: 0
 <1><bfc>: Abbrev Number: 17 (DW_TAG_subprogram)
    <bfd>   DW_AT_external    : 1
    <bfd>   DW_AT_name        : (indirect string, offset: 0x7462f): HAL_RCC_ClockConfig
    <c01>   DW_AT_decl_file   : 7
    <c02>   DW_AT_decl_line   : 1156
    <c04>   DW_AT_decl_column : 19
    <c05>   DW_AT_prototyped  : 1
    <c05>   DW_AT_type        : <0x383>
    <c09>   DW_AT_declaration : 1
    <c09>   DW_AT_sibling     : <0xc18>
 <2><c0d>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c0e>   DW_AT_type        : <0xc18>
 <2><c12>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c13>   DW_AT_type        : <0x94>
 <2><c17>: Abbrev Number: 0
 <1><c18>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c19>   DW_AT_byte_size   : 4
    <c19>   DW_AT_type        : <0x43c>
 <1><c1d>: Abbrev Number: 17 (DW_TAG_subprogram)
    <c1e>   DW_AT_external    : 1
    <c1e>   DW_AT_name        : (indirect string, offset: 0x5df05): HAL_RCC_OscConfig
    <c22>   DW_AT_decl_file   : 7
    <c23>   DW_AT_decl_line   : 1155
    <c25>   DW_AT_decl_column : 19
    <c26>   DW_AT_prototyped  : 1
    <c26>   DW_AT_type        : <0x383>
    <c2a>   DW_AT_declaration : 1
    <c2a>   DW_AT_sibling     : <0xc34>
 <2><c2e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c2f>   DW_AT_type        : <0xc34>
 <2><c33>: Abbrev Number: 0
 <1><c34>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c35>   DW_AT_byte_size   : 4
    <c35>   DW_AT_type        : <0x4b9>
 <1><c39>: Abbrev Number: 20 (DW_TAG_subprogram)
    <c3a>   DW_AT_external    : 1
    <c3a>   DW_AT_name        : (indirect string, offset: 0x734ed): osKernelStart
    <c3e>   DW_AT_decl_file   : 12
    <c3f>   DW_AT_decl_line   : 302
    <c41>   DW_AT_decl_column : 12
    <c42>   DW_AT_prototyped  : 1
    <c42>   DW_AT_type        : <0xa61>
    <c46>   DW_AT_declaration : 1
 <1><c46>: Abbrev Number: 17 (DW_TAG_subprogram)
    <c47>   DW_AT_external    : 1
    <c47>   DW_AT_name        : (indirect string, offset: 0x4b0da): osThreadNew
    <c4b>   DW_AT_decl_file   : 12
    <c4c>   DW_AT_decl_line   : 349
    <c4e>   DW_AT_decl_column : 14
    <c4f>   DW_AT_prototyped  : 1
    <c4f>   DW_AT_type        : <0xa6d>
    <c53>   DW_AT_declaration : 1
    <c53>   DW_AT_sibling     : <0xc67>
 <2><c57>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c58>   DW_AT_type        : <0xa07>
 <2><c5c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c5d>   DW_AT_type        : <0x68d>
 <2><c61>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c62>   DW_AT_type        : <0xc67>
 <2><c66>: Abbrev Number: 0
 <1><c67>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c68>   DW_AT_byte_size   : 4
    <c68>   DW_AT_type        : <0xb20>
 <1><c6c>: Abbrev Number: 20 (DW_TAG_subprogram)
    <c6d>   DW_AT_external    : 1
    <c6d>   DW_AT_name        : (indirect string, offset: 0x18a84): osKernelInitialize
    <c71>   DW_AT_decl_file   : 12
    <c72>   DW_AT_decl_line   : 287
    <c74>   DW_AT_decl_column : 12
    <c75>   DW_AT_prototyped  : 1
    <c75>   DW_AT_type        : <0xa61>
    <c79>   DW_AT_declaration : 1
 <1><c79>: Abbrev Number: 20 (DW_TAG_subprogram)
    <c7a>   DW_AT_external    : 1
    <c7a>   DW_AT_name        : (indirect string, offset: 0x7e88c): HAL_Init
    <c7e>   DW_AT_decl_file   : 13
    <c7f>   DW_AT_decl_line   : 282
    <c81>   DW_AT_decl_column : 19
    <c82>   DW_AT_prototyped  : 1
    <c82>   DW_AT_type        : <0x383>
    <c86>   DW_AT_declaration : 1
 <1><c86>: Abbrev Number: 37 (DW_TAG_subprogram)
    <c87>   DW_AT_external    : 1
    <c87>   DW_AT_name        : (indirect string, offset: 0x3c65c): Error_Handler
    <c8b>   DW_AT_decl_file   : 1
    <c8c>   DW_AT_decl_line   : 332
    <c8e>   DW_AT_decl_column : 6
    <c8f>   DW_AT_prototyped  : 1
    <c8f>   DW_AT_low_pc      : 0x800038c
    <c93>   DW_AT_high_pc     : 0xc
    <c97>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c99>   DW_AT_call_all_calls: 1
    <c99>   DW_AT_sibling     : <0xcaf>
 <2><c9d>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <c9e>   DW_AT_abstract_origin: <0xdfa>
    <ca2>   DW_AT_low_pc      : 0x8000390
    <ca6>   DW_AT_high_pc     : 0x4
    <caa>   DW_AT_call_file   : 1
    <cab>   DW_AT_call_line   : 336
    <cad>   DW_AT_call_column : 3
 <2><cae>: Abbrev Number: 0
 <1><caf>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cb0>   DW_AT_external    : 1
    <cb0>   DW_AT_name        : (indirect string, offset: 0x1aa00): HAL_TIM_PeriodElapsedCallback
    <cb4>   DW_AT_decl_file   : 1
    <cb4>   DW_AT_decl_line   : 315
    <cb6>   DW_AT_decl_column : 6
    <cb6>   DW_AT_prototyped  : 1
    <cb6>   DW_AT_low_pc      : 0x8000368
    <cba>   DW_AT_high_pc     : 0x24
    <cbe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc0>   DW_AT_call_all_tail_calls: 1
    <cc0>   DW_AT_sibling     : <0xcd4>
 <2><cc4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <cc5>   DW_AT_name        : (indirect string, offset: 0x6aab3): htim
    <cc9>   DW_AT_decl_file   : 1
    <cc9>   DW_AT_decl_line   : 315
    <ccb>   DW_AT_decl_column : 55
    <ccc>   DW_AT_type        : <0xcd4>
    <cd0>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cd3>: Abbrev Number: 0
 <1><cd4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cd5>   DW_AT_byte_size   : 4
    <cd5>   DW_AT_type        : <0x8a2>
 <1><cd9>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cda>   DW_AT_external    : 1
    <cda>   DW_AT_name        : (indirect string, offset: 0x6f076): FlashGreenLedTask
    <cde>   DW_AT_decl_file   : 1
    <cde>   DW_AT_decl_line   : 290
    <ce0>   DW_AT_decl_column : 6
    <ce0>   DW_AT_prototyped  : 1
    <ce0>   DW_AT_low_pc      : 0x800030c
    <ce4>   DW_AT_high_pc     : 0x5c
    <ce8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cea>   DW_AT_call_all_tail_calls: 1
    <cea>   DW_AT_sibling     : <0xd15>
 <2><cee>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <cef>   DW_AT_name        : (indirect string, offset: 0x1cda0): argument
    <cf3>   DW_AT_decl_file   : 1
    <cf3>   DW_AT_decl_line   : 290
    <cf5>   DW_AT_decl_column : 30
    <cf6>   DW_AT_type        : <0x68d>
    <cfa>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><cfd>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <cfe>   DW_AT_low_pc      : 0x8000320
    <d02>   DW_AT_high_pc     : 0x22
 <3><d06>: Abbrev Number: 30 (DW_TAG_variable)
    <d07>   DW_AT_name        : i
    <d09>   DW_AT_decl_file   : 1
    <d09>   DW_AT_decl_line   : 296
    <d0b>   DW_AT_decl_column : 19
    <d0c>   DW_AT_type        : <0x7a>
    <d10>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><d13>: Abbrev Number: 0
 <2><d14>: Abbrev Number: 0
 <1><d15>: Abbrev Number: 21 (DW_TAG_subprogram)
    <d16>   DW_AT_external    : 1
    <d16>   DW_AT_name        : (indirect string, offset: 0x4e67f): FlashRedLedTask
    <d1a>   DW_AT_decl_file   : 1
    <d1a>   DW_AT_decl_line   : 264
    <d1c>   DW_AT_decl_column : 6
    <d1c>   DW_AT_prototyped  : 1
    <d1c>   DW_AT_low_pc      : 0x80002b0
    <d20>   DW_AT_high_pc     : 0x5c
    <d24>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d26>   DW_AT_call_all_tail_calls: 1
    <d26>   DW_AT_sibling     : <0xd51>
 <2><d2a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x1cda0): argument
    <d2f>   DW_AT_decl_file   : 1
    <d2f>   DW_AT_decl_line   : 264
    <d31>   DW_AT_decl_column : 28
    <d32>   DW_AT_type        : <0x68d>
    <d36>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d39>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <d3a>   DW_AT_low_pc      : 0x80002c4
    <d3e>   DW_AT_high_pc     : 0x22
 <3><d42>: Abbrev Number: 30 (DW_TAG_variable)
    <d43>   DW_AT_name        : i
    <d45>   DW_AT_decl_file   : 1
    <d45>   DW_AT_decl_line   : 271
    <d47>   DW_AT_decl_column : 15
    <d48>   DW_AT_type        : <0x7a>
    <d4c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><d4f>: Abbrev Number: 0
 <2><d50>: Abbrev Number: 0
 <1><d51>: Abbrev Number: 31 (DW_TAG_subprogram)
    <d52>   DW_AT_external    : 1
    <d52>   DW_AT_name        : (indirect string, offset: 0x1dfff): StartDefaultTask
    <d56>   DW_AT_decl_file   : 1
    <d56>   DW_AT_decl_line   : 246
    <d57>   DW_AT_decl_column : 6
    <d57>   DW_AT_prototyped  : 1
    <d57>   DW_AT_low_pc      : 0x80002a0
    <d5b>   DW_AT_high_pc     : 0x10
    <d5f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d61>   DW_AT_call_all_tail_calls: 1
    <d61>   DW_AT_sibling     : <0xd75>
 <2><d65>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <d66>   DW_AT_name        : (indirect string, offset: 0x1cda0): argument
    <d6a>   DW_AT_decl_file   : 1
    <d6b>   DW_AT_decl_line   : 246
    <d6c>   DW_AT_decl_column : 29
    <d6d>   DW_AT_type        : <0x68d>
    <d71>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d74>: Abbrev Number: 0
 <1><d75>: Abbrev Number: 40 (DW_TAG_subprogram)
    <d76>   DW_AT_name        : (indirect string, offset: 0x37752): MX_GPIO_Init
    <d7a>   DW_AT_decl_file   : 1
    <d7b>   DW_AT_decl_line   : 212
    <d7c>   DW_AT_decl_column : 13
    <d7d>   DW_AT_prototyped  : 1
    <d7d>   DW_AT_low_pc      : 0x8000238
    <d81>   DW_AT_high_pc     : 0x68
    <d85>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d87>   DW_AT_call_all_tail_calls: 1
    <d87>   DW_AT_sibling     : <0xdb2>
 <2><d8b>: Abbrev Number: 18 (DW_TAG_variable)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xd1df): GPIO_InitStruct
    <d90>   DW_AT_decl_file   : 1
    <d90>   DW_AT_decl_line   : 214
    <d91>   DW_AT_decl_column : 20
    <d92>   DW_AT_type        : <0x503>
    <d96>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d99>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <d9a>   DW_AT_low_pc      : 0x800024c
    <d9e>   DW_AT_high_pc     : 0x18
 <3><da2>: Abbrev Number: 18 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0xfbb): tmpreg
    <da7>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 219
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xa0>
    <dad>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><db0>: Abbrev Number: 0
 <2><db1>: Abbrev Number: 0
 <1><db2>: Abbrev Number: 31 (DW_TAG_subprogram)
    <db3>   DW_AT_external    : 1
    <db3>   DW_AT_name        : (indirect string, offset: 0x5e217): SystemClock_Config
    <db7>   DW_AT_decl_file   : 1
    <db7>   DW_AT_decl_line   : 175
    <db8>   DW_AT_decl_column : 6
    <db8>   DW_AT_prototyped  : 1
    <db8>   DW_AT_low_pc      : 0x80001c0
    <dbc>   DW_AT_high_pc     : 0x76
    <dc0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc2>   DW_AT_call_all_tail_calls: 1
    <dc2>   DW_AT_sibling     : <0xde4>
 <2><dc6>: Abbrev Number: 18 (DW_TAG_variable)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x1d5e2): RCC_OscInitStruct
    <dcb>   DW_AT_decl_file   : 1
    <dcb>   DW_AT_decl_line   : 177
    <dcc>   DW_AT_decl_column : 22
    <dcd>   DW_AT_type        : <0x4b9>
    <dd1>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><dd4>: Abbrev Number: 18 (DW_TAG_variable)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x331ac): RCC_ClkInitStruct
    <dd9>   DW_AT_decl_file   : 1
    <dd9>   DW_AT_decl_line   : 178
    <dda>   DW_AT_decl_column : 22
    <ddb>   DW_AT_type        : <0x43c>
    <ddf>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><de3>: Abbrev Number: 0
 <1><de4>: Abbrev Number: 41 (DW_TAG_subprogram)
    <de5>   DW_AT_external    : 1
    <de5>   DW_AT_name        : (indirect string, offset: 0xd7d6): main
    <de9>   DW_AT_decl_file   : 1
    <dea>   DW_AT_decl_line   : 89
    <deb>   DW_AT_decl_column : 5
    <dec>   DW_AT_prototyped  : 1
    <dec>   DW_AT_type        : <0x7a>
    <df0>   DW_AT_low_pc      : 0x8000150
    <df4>   DW_AT_high_pc     : 0x70
    <df8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dfa>   DW_AT_call_all_tail_calls: 1
 <1><dfa>: Abbrev Number: 42 (DW_TAG_subprogram)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x4ac1b): __disable_irq
    <dff>   DW_AT_decl_file   : 2
    <e00>   DW_AT_decl_line   : 140
    <e01>   DW_AT_decl_column : 27
    <e02>   DW_AT_prototyped  : 1
    <e02>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><e03>: Abbrev Number: 0
  Compilation Unit @ offset 0xe04:
   Length:        0x35d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2b0
   Pointer Size:  4
 <0><e10>: Abbrev Number: 13 (DW_TAG_compile_unit)
    <e11>   DW_AT_producer    : (indirect string, offset: 0x1b128): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e15>   DW_AT_language    : 29	(C11)
    <e16>   DW_AT_name        : (indirect string, offset: 0x877e4): ../Core/Src/stm32f1xx_hal_msp.c
    <e1a>   DW_AT_comp_dir    : (indirect string, offset: 0x49144): C:/Users/HP/STM32CubeIDE/workspace_1.16.0/2LED/Debug
    <e1e>   DW_AT_ranges      : 0x49
    <e22>   DW_AT_low_pc      : 0
    <e26>   DW_AT_stmt_list   : 0xac1
    <e2a>   DW_AT_macros      : 0x58d
 <1><e2e>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <e2f>   DW_AT_encoding    : 5	(signed)
    <e30>   DW_AT_byte_size   : 1
    <e31>   DW_AT_type        : <0xf75>
    <e35>   DW_AT_decl_file   : 2
    <e36>   DW_AT_decl_line   : 69
    <e37>   DW_AT_decl_column : 1
    <e38>   DW_AT_sibling     : <0xf75>
 <2><e3c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x8762b): NonMaskableInt_IRQn
    <e41>   DW_AT_const_value : -14
 <2><e42>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e43>   DW_AT_name        : (indirect string, offset: 0x875d4): HardFault_IRQn
    <e47>   DW_AT_const_value : -13
 <2><e48>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e49>   DW_AT_name        : (indirect string, offset: 0x876d5): MemoryManagement_IRQn
    <e4d>   DW_AT_const_value : -12
 <2><e4e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x877b6): BusFault_IRQn
    <e53>   DW_AT_const_value : -11
 <2><e54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e55>   DW_AT_name        : (indirect string, offset: 0x8774b): UsageFault_IRQn
    <e59>   DW_AT_const_value : -10
 <2><e5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x875b5): SVCall_IRQn
    <e5f>   DW_AT_const_value : -5
 <2><e60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0x876eb): DebugMonitor_IRQn
    <e65>   DW_AT_const_value : -4
 <2><e66>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e67>   DW_AT_name        : (indirect string, offset: 0x8770b): PendSV_IRQn
    <e6b>   DW_AT_const_value : -2
 <2><e6c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x877d7): SysTick_IRQn
    <e71>   DW_AT_const_value : -1
 <2><e72>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e73>   DW_AT_name        : (indirect string, offset: 0x87777): WWDG_IRQn
    <e77>   DW_AT_const_value : 0
 <2><e78>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e79>   DW_AT_name        : (indirect string, offset: 0x87622): PVD_IRQn
    <e7d>   DW_AT_const_value : 1
 <2><e7e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x8767f): TAMPER_IRQn
    <e83>   DW_AT_const_value : 2
 <2><e84>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e85>   DW_AT_name        : (indirect string, offset: 0x876fd): RTC_IRQn
    <e89>   DW_AT_const_value : 3
 <2><e8a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x8763f): FLASH_IRQn
    <e8f>   DW_AT_const_value : 4
 <2><e90>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e91>   DW_AT_name        : (indirect string, offset: 0x877ad): RCC_IRQn
    <e95>   DW_AT_const_value : 5
 <2><e96>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x8780f): EXTI0_IRQn
    <e9b>   DW_AT_const_value : 6
 <2><e9c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x87887): EXTI1_IRQn
    <ea1>   DW_AT_const_value : 7
 <2><ea2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x876b2): EXTI2_IRQn
    <ea7>   DW_AT_const_value : 8
 <2><ea8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x87804): EXTI3_IRQn
    <ead>   DW_AT_const_value : 9
 <2><eae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x87617): EXTI4_IRQn
    <eb3>   DW_AT_const_value : 10
 <2><eb4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x87656): DMA1_Channel1_IRQn
    <eb9>   DW_AT_const_value : 11
 <2><eba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x8778d): DMA1_Channel2_IRQn
    <ebf>   DW_AT_const_value : 12
 <2><ec0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x87604): DMA1_Channel3_IRQn
    <ec5>   DW_AT_const_value : 13
 <2><ec6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x8772b): DMA1_Channel4_IRQn
    <ecb>   DW_AT_const_value : 14
 <2><ecc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x875c1): DMA1_Channel5_IRQn
    <ed1>   DW_AT_const_value : 15
 <2><ed2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x876bd): DMA1_Channel6_IRQn
    <ed7>   DW_AT_const_value : 16
 <2><ed8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x8785d): DMA1_Channel7_IRQn
    <edd>   DW_AT_const_value : 17
 <2><ede>: Abbrev Number: 1 (DW_TAG_enumerator)
    <edf>   DW_AT_name        : (indirect string, offset: 0x48021): ADC1_2_IRQn
    <ee3>   DW_AT_const_value : 18
 <2><ee4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x3bd17): USB_HP_CAN1_TX_IRQn
    <ee9>   DW_AT_const_value : 19
 <2><eea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x8216e): USB_LP_CAN1_RX0_IRQn
    <eef>   DW_AT_const_value : 20
 <2><ef0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x87769): CAN1_RX1_IRQn
    <ef5>   DW_AT_const_value : 21
 <2><ef6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x8775b): CAN1_SCE_IRQn
    <efb>   DW_AT_const_value : 22
 <2><efc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <efd>   DW_AT_name        : (indirect string, offset: 0x87870): EXTI9_5_IRQn
    <f01>   DW_AT_const_value : 23
 <2><f02>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f03>   DW_AT_name        : (indirect string, offset: 0x25849): TIM1_BRK_IRQn
    <f07>   DW_AT_const_value : 24
 <2><f08>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f09>   DW_AT_name        : (indirect string, offset: 0x50450): TIM1_UP_IRQn
    <f0d>   DW_AT_const_value : 25
 <2><f0e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x2bab2): TIM1_TRG_COM_IRQn
    <f13>   DW_AT_const_value : 26
 <2><f14>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f15>   DW_AT_name        : (indirect string, offset: 0x877a0): TIM1_CC_IRQn
    <f19>   DW_AT_const_value : 27
 <2><f1a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x875fa): TIM2_IRQn
    <f1f>   DW_AT_const_value : 28
 <2><f20>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f21>   DW_AT_name        : (indirect string, offset: 0x87721): TIM3_IRQn
    <f25>   DW_AT_const_value : 29
 <2><f26>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f27>   DW_AT_name        : (indirect string, offset: 0x87675): TIM4_IRQn
    <f2b>   DW_AT_const_value : 30
 <2><f2c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x8768b): I2C1_EV_IRQn
    <f31>   DW_AT_const_value : 31
 <2><f32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x8773e): I2C1_ER_IRQn
    <f37>   DW_AT_const_value : 32
 <2><f38>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0x875e3): I2C2_EV_IRQn
    <f3d>   DW_AT_const_value : 33
 <2><f3e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x876a5): I2C2_ER_IRQn
    <f43>   DW_AT_const_value : 34
 <2><f44>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x875f0): SPI1_IRQn
    <f49>   DW_AT_const_value : 35
 <2><f4a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x87717): SPI2_IRQn
    <f4f>   DW_AT_const_value : 36
 <2><f50>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f51>   DW_AT_name        : (indirect string, offset: 0x877cb): USART1_IRQn
    <f55>   DW_AT_const_value : 37
 <2><f56>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x8764a): USART2_IRQn
    <f5b>   DW_AT_const_value : 38
 <2><f5c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x87781): USART3_IRQn
    <f61>   DW_AT_const_value : 39
 <2><f62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f63>   DW_AT_name        : (indirect string, offset: 0x8782f): EXTI15_10_IRQn
    <f67>   DW_AT_const_value : 40
 <2><f68>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f69>   DW_AT_name        : (indirect string, offset: 0x87844): RTC_Alarm_IRQn
    <f6d>   DW_AT_const_value : 41
 <2><f6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x828fd): USBWakeUp_IRQn
    <f73>   DW_AT_const_value : 42
 <2><f74>: Abbrev Number: 0
 <1><f75>: Abbrev Number: 3 (DW_TAG_base_type)
    <f76>   DW_AT_byte_size   : 1
    <f77>   DW_AT_encoding    : 6	(signed char)
    <f78>   DW_AT_name        : (indirect string, offset: 0x43f81): signed char
 <1><f7c>: Abbrev Number: 5 (DW_TAG_typedef)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x87853): IRQn_Type
    <f81>   DW_AT_decl_file   : 2
    <f82>   DW_AT_decl_line   : 125
    <f83>   DW_AT_decl_column : 3
    <f84>   DW_AT_type        : <0xe2e>
 <1><f88>: Abbrev Number: 3 (DW_TAG_base_type)
    <f89>   DW_AT_byte_size   : 1
    <f8a>   DW_AT_encoding    : 8	(unsigned char)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x1b727): unsigned char
 <1><f8f>: Abbrev Number: 3 (DW_TAG_base_type)
    <f90>   DW_AT_byte_size   : 2
    <f91>   DW_AT_encoding    : 5	(signed)
    <f92>   DW_AT_name        : (indirect string, offset: 0x651de): short int
 <1><f96>: Abbrev Number: 3 (DW_TAG_base_type)
    <f97>   DW_AT_byte_size   : 2
    <f98>   DW_AT_encoding    : 7	(unsigned)
    <f99>   DW_AT_name        : (indirect string, offset: 0x2c6b3): short unsigned int
 <1><f9d>: Abbrev Number: 3 (DW_TAG_base_type)
    <f9e>   DW_AT_byte_size   : 4
    <f9f>   DW_AT_encoding    : 5	(signed)
    <fa0>   DW_AT_name        : (indirect string, offset: 0xb862): long int
 <1><fa4>: Abbrev Number: 5 (DW_TAG_typedef)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x56509): __uint32_t
    <fa9>   DW_AT_decl_file   : 3
    <faa>   DW_AT_decl_line   : 79
    <fab>   DW_AT_decl_column : 25
    <fac>   DW_AT_type        : <0xfb0>
 <1><fb0>: Abbrev Number: 3 (DW_TAG_base_type)
    <fb1>   DW_AT_byte_size   : 4
    <fb2>   DW_AT_encoding    : 7	(unsigned)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x1ff2c): long unsigned int
 <1><fb7>: Abbrev Number: 3 (DW_TAG_base_type)
    <fb8>   DW_AT_byte_size   : 8
    <fb9>   DW_AT_encoding    : 5	(signed)
    <fba>   DW_AT_name        : (indirect string, offset: 0x3e304): long long int
 <1><fbe>: Abbrev Number: 3 (DW_TAG_base_type)
    <fbf>   DW_AT_byte_size   : 8
    <fc0>   DW_AT_encoding    : 7	(unsigned)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x1bea3): long long unsigned int
 <1><fc5>: Abbrev Number: 15 (DW_TAG_base_type)
    <fc6>   DW_AT_byte_size   : 4
    <fc7>   DW_AT_encoding    : 5	(signed)
    <fc8>   DW_AT_name        : int
 <1><fcc>: Abbrev Number: 3 (DW_TAG_base_type)
    <fcd>   DW_AT_byte_size   : 4
    <fce>   DW_AT_encoding    : 7	(unsigned)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xb260): unsigned int
 <1><fd3>: Abbrev Number: 5 (DW_TAG_typedef)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x62afc): uint32_t
    <fd8>   DW_AT_decl_file   : 4
    <fd9>   DW_AT_decl_line   : 48
    <fda>   DW_AT_decl_column : 20
    <fdb>   DW_AT_type        : <0xfa4>
 <1><fdf>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <fe0>   DW_AT_type        : <0xfd3>
 <1><fe4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <fe5>   DW_AT_byte_size   : 32
    <fe6>   DW_AT_decl_file   : 2
    <fe6>   DW_AT_decl_line   : 372
    <fe8>   DW_AT_decl_column : 9
    <fe8>   DW_AT_sibling     : <0x102e>
 <2><fec>: Abbrev Number: 2 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x876d0): EVCR
    <ff1>   DW_AT_decl_file   : 2
    <ff1>   DW_AT_decl_line   : 374
    <ff3>   DW_AT_decl_column : 17
    <ff4>   DW_AT_type        : <0xfdf>
    <ff8>   DW_AT_data_member_location: 0
